{
"nome": "Text/01_inroducao.html",
"conteúdo": "INTRODUÇÃO AO DIREITO CIVIL Capítulo I CONCEITO E DIVISÃO DO DIREITO Sumário: 1. Conceito de direito. 2. Distinção entre o direito e a moral. 3. Direito positivo e direito natural. 4. Direito objetivo e direito subjetivo. 5. Direito público e direito privado. 6. A unificação do direito privado. 1. Conceito de direito O homem é um ser eminentemente social. Não vive isolado, mas em grupos. A convivência impõe uma certa ordem, determinada por regras de conduta. Essa ordenação pressupõe a existência de restrições que limitam a atividade dos indivíduos componentes dos diversos grupos sociais. O fim do direito é precisamente determinar regras que permitam aos homens a vida em sociedade1. Em todo tempo, por mais distante que se olhe no passado, em qualquer agrupamento social, por mais rudimentar que seja, sempre se encontrará presente o fenômeno jurídico, representado pela observância de um mínimo de condições existenciais da vida em sociedade. Seja na unidade tribal em estado primitivo, seja na unidade estatal, sempre houve e haverá uma norma, uma regra de conduta pautando a atuação do indivíduo, nas suas relações com os outros indivíduos2. A ordem jurídica tem, assim, como premissa o estabelecimento dessas restrições, a determinação desses limites aos indivíduos, aos quais todos indistintamente devem se submeter, para que se torne possível a coexistência social3. Não há um consenso sobre o conceito do direito. A esse respeito divergem juristas, filósofos e sociólogos, desde tempos remotos. Deixando de lado as várias escolas e correntes existentes, apontamos como ideal, pela concisão e clareza, a definição de Radbruch4, citada por Washington de Barros Monteiro5, segundo a qual direito “é o conjunto das normas gerais e positivas, que regulam a vida social”. A palavra “direito” é usada, na acepção comum, para designar o conjunto de regras com que se disciplina a vida em sociedade, regras essas que se caracterizam pelo caráter genérico, concernente à indistinta aplicação a todos os indivíduos, e jurídico, que as diferencia das demais regras de comportamento social e lhes confere eficácia garantida pelo Estado. As referidas normas de conduta encontram-se nas leis, nos costumes, na jurisprudência, nos princípios gerais do direito, constituindo o direito objetivo e positivo, posto na sociedade por uma vontade superior6. Origina-se a palavra “direito” do latim directum, significando aquilo que é reto, que está de acordo com a lei. Os jurisconsultos romanos já relacionavam o direito com o que é justo. Da necessidade da justiça nas relações humanas é que nasce o direito. De outra parte, a criação do direito não tem outro objetivo senão a realização da justiça. No ensinamento de Aristóteles, aperfeiçoado pela filosofia escolástica, a justiça é a perpétua vontade de dar a cada um o que é seu, segundo uma igualdade7. O direito nasceu junto com o homem que, por natureza, é um ser social. As normas de direito, como visto, asseguram as condições de equilíbrio da coexistência dos seres humanos, da vida em sociedade. Para Caio Mário da Silva Pereira, que prefere deixar de lado as concepções dos historicistas, dos normativistas, dos finalistas e dos sociólogos do direito, que não conseguiram fornecer uma definição satisfatória, o direito “é o princípio de adequação do homem à vida social. Está na lei, como exteriorização do comando do Estado; integra-se na consciência do indivíduo que pauta sua conduta pelo espiritualismo do seu elevado grau de moralidade; está no anseio de justiça, como ideal eterno do homem; está imanente na necessidade de contenção para a coexistência”8. Há marcante diferença entre o “ser” do mundo da natureza e o “dever ser” do mundo jurídico. Os fenômenos da natureza, sujeitos às leis físicas, são imutáveis, enquanto o mundo jurídico, o do “dever ser”, caracteriza-se pela liberdade na escolha da conduta. Direito, portanto, é a ciência do “dever ser”. 2. Distinção entre o direito e a moral A vida em sociedade exige a observância de outras normas, além das jurídicas. As pessoas devem pautar a sua conduta pela ética, de conteúdo mais abrangente do que o direito, porque ela compreende as normas jurídicas e as normas morais. Para desenvolver a espiritualidade e cultuar as santidades, as pessoas devem obedecer aos princípios religiosos. Para gozar de boa saúde, devem seguir os preceitos higiênicos. Para bem se relacionar e desfrutar de prestígio social, devem observar as regras de etiqueta e urbanidade etc.9. As normas jurídicas e morais têm em comum o fato de constituírem regras de comportamento. No entanto, distinguem-se precipuamente pela sanção (que no direito é imposta pelo Estado para constranger os indivíduos à observância da norma, e na moral somente pela consciência do homem, traduzida pelo remorso, pelo arrependimento, porém sem coerção) e pelo campo de ação, que na moral é mais amplo. Com efeito, as ações humanas interessam ao direito, mas nem sempre. Quando “são impostas ou proibidas, encontram sanção no ordenamento jurídico. São as normas jurídicas, são os princípios de direito. Quando se cumprem ou se descumprem sem que este interfira, vão buscar sanção no foro íntimo, no foro da consciência, até onde não chega a força cogente do Estado. É, porém, certo que o princípio moral envolve a norma jurídica, podendo-se dizer que, geralmente, a ação juridicamente condenável o é também pela moral. Mas a coincidência não é absoluta”10. Desse modo, nem tudo que é moral é jurídico, pois a justiça é apenas uma parte do objeto da moral. É célebre, neste aspecto, a comparação de Bentham, utilizando-se de dois círculos concêntricos, dos quais a circunferência representativa do campo da moral se mostra mais ampla, contendo todas as normas reguladoras da vida em sociedade. O círculo menor, que representa o direito, abrange somente aquelas dotadas de força coercitiva. A principal diferença entre a regra moral e a regra jurídica repousa efetivamente na sanção. Pode-se afirmar que direito e moral distinguem-se, ainda, pelo fato de o primeiro atuar no foro exterior, ensejando medidas repressivas do aparelho estatal quando violado, e a segunda no foro íntimo das pessoas, encontrando reprovação na sua consciência. Sob outro aspecto, afirmam os irmãos Mazeaud que a moral procura fazer que reine não apenas a justiça, mas também a caridade, que tende ao aperfeiçoamento individual11. Algumas vezes tem acontecido de o direito trazer para sua esfera de atuação preceitos da moral, considerados merecedores de sanção mais eficaz, pois malgrado diversos os seus campos de atuação, entrelaçam-se e interpenetram-se de mil maneiras. Podem ser lembrados, a título de exemplos, o art. 17 da Lei de Introdução ao Código Civil (atual Lei de Introdução às Normas do Direito Brasileiro, conforme estabelecido na Lei n. 12.376, de 30-12-2010) e os arts. 557, 1.638 e 1.735, V, todos do Código Civil. Há mesmo uma tendência das normas morais a converter-se em normas jurídicas, como ocorreu, exemplificativamente, com o dever do pai de velar pelo filho, com a indenização por acidente do trabalho e por despedimento do empregado, com a obrigação de dar a este aviso prévio etc.12. 3. Direito positivo e direito natural Direito positivo é o ordenamento jurídico em vigor num determinado país e numa determinada época (jus in civitate positum). Direito natural é a ideia abstrata do direito, o ordenamento ideal, correspondente a uma justiça superior e suprema13. O direito positivo, em outras palavras, é o “conjunto de princípios que pautam a vida social de determinado povo em determinada época”, sendo nesta acepção que nos referimos ao direito romano, ao direito inglês, ao direito alemão, ao direito brasileiro etc., não importando seja escrito ou não escrito, de elaboração sistemática ou de formação jurisprudencial14. Segundo Capitant, é o que está em vigor num povo determinado, e compreende toda a disciplina da conduta, abrangendo as leis votadas pelo poder competente, os regulamentos, as disposições normativas de qualquer espécie. O fundamento de sua existência está ligado ao conceito de vigência15. Na época moderna, o direito natural desenvolve-se sob o nome de jusnaturalismo, sendo visto como “expressão de princípios superiores ligados à natureza racional e social do homem”16. O jusnaturalismo foi defendido por Santo Agostinho e São Tomás de Aquino, bem como pelos doutores da Igreja e pensadores dos séculos XVII e XVIII. Hugo Grócio, já no século XVI, defendia a existência de um direito ideal e eterno, ao lado do direito positivo, sendo considerado o fundador da nova Escola de Direito Natural. A Escola Histórica e a Escola Positivista, entretanto, refutam o jusnaturalismo, atendo-se à realidade concreta do direito positivo. No século XIX, renasceu e predominou a ideia jusnaturalista, especialmente em razão do movimento neotomista e da ideia neokantiana. É realmente inegável a existência de leis anteriores e inspiradoras do direito positivo, as quais, mesmo não escritas, encontram-se na consciência dos povos. Malgrado a aparente antinomia, não se pode falar em contraposição entre ambos, pois que, “se um é a fonte de inspiração do outro, não exprimem ideias antagônicas, mas, ao revés, tendem a uma convergência ideológica, ou, ao menos, devem procurá-la, o direito positivo amparando-se na sujeição ao direito natural para que a regra realize o ideal, e o direito natural inspirando o direito positivo para que este se aproxime da perfeição”17. Na realidade, o direito natural, a exemplo do que sucede com as normas morais, tende a converter-se em direito positivo, ou a modificar o direito preexistente18. Para o direito positivo não é exigível o pagamento de dívida prescrita e de dívida de jogo (arts. 814 e 882)19. Mas para o direito natural esse pagamento é obrigatório. 4. Direito objetivo e direito subjetivo Direito objetivo é o conjunto de normas impostas pelo Estado, de caráter geral, a cuja inobservância os indivíduos podem ser compelidos mediante coerção. Esse conjunto de regras jurídicas comportamentais (norma agendi) gera para os indivíduos a faculdade de satisfazer determinadas pretensões e de praticar os atos destinados a alcançar tais objetivos (facultas agendi). Encarado sob esse aspecto, denomina-se direito subjetivo, que nada mais é do que a faculdade individual de agir de acordo com o direito objetivo, de invocar a sua proteção. Silvio Rodrigues, com precisão, esclarece: “O fenômeno jurídico, embora seja um só, pode ser encarado sob mais de um ângulo. Vendo-o como um conjunto de normas que a todos se dirige e a todos vincula, temos o direito objetivo. É a norma da ação humana, isto é, a norma agendi. Se, entretanto, o observador encara o fenômeno através da prerrogativa que para o indivíduo decorre da norma, tem-se o direito subjetivo. Trata-se da faculdade conferida ao indivíduo de invocar a norma em seu favor, ou seja, da faculdade de agir sob a sombra da regra, isto é, a facultas agendi”20. Direito subjetivo é “o poder que a ordem jurídica confere a alguém de agir e de exigir de outrem determinado comportamento”21. É, portanto, o meio de satisfazer interesses humanos e deriva do direito objetivo, nascendo com ele. Se o direito objetivo é modificado, altera-se o direito subjetivo. Podemos dizer que há referência ao direito objetivo quando se diz, por exemplo, que “o direito impõe a todos o respeito à propriedade”; e que é feita alusão ao direito subjetivo quando se proclama que “o proprietário tem o direito de repelir a agressão à coisa que lhe pertence”.22 As teorias de Duguit e de Kelsen (Teoria Pura do Direito) integram as doutrinas negativistas, que não admitem a existência do direito subjetivo. Para Kelsen, a obrigação jurídica não é senão a própria norma jurídica. Sendo assim, o direito subjetivo não é senão o direito objetivo. Reconhece ele somente a existência deste, não aceitando o dualismo direito objetivo-direito subjetivo, que encerra um componente ideológico. Predominam, no entanto, as doutrinas afirmativas, que reconhecem a existência do direito subjetivo, tanto no aspecto técnico como do ponto de vista histórico. Essas doutrinas se desdobram em: a) teoria da vontade; b) teoria do interesse; e c) teoria mista. Para a teoria da vontade, de Savigny, Windscheid e outros, o direito subjetivo constitui um poder da vontade reconhecido pela ordem jurídica. O Estado somente intervém quando estritamente necessário. Nesse caso, o titular do direito é o único juiz da conveniência de sua utilização. Todavia, há direitos em que não existe uma vontade real do seu titular. Os incapazes, por exemplo, têm direito subjetivo, podendo herdar, ser proprietários, embora não possuam vontade em sentido jurídico. Para a teoria do interesse, defendida por Ihering, direito subjetivo é o interesse juridicamente protegido23. Ambas as teorias são passíveis de críticas. Não se pode aceitar que o direito subjetivo, sendo um poder conferido a alguém pelo ordenamento jurídico, dependa da vontade do titular para ter eficácia. Na realidade, ele existe e é eficaz independentemente do interesse deste. A teoria de Ihering, que considera direito subjetivo o “interesse juridicamente protegido”, é também criticável, pois confunde o direito subjetivo com o seu conteúdo24. A teoria mista, ou eclética, conjuga o elemento vontade com o elemento interesse. Jellinek o define como o interesse protegido que a vontade tem o poder de realizar. Consistindo na reunião dos elementos básicos das duas teorias anteriormente mencionadas, a vontade e o interesse, merecem também as mesmas críticas. O direito subjetivo, em verdade, não constitui nem poder da vontade, nem interesse protegido, mas apenas “um poder de agir e de exigir determinado comportamento para a realização de um interesse, pressupondo a existência de uma relação jurídica. Seu fundamento é a autonomia dos sujeitos, a liberdade natural que se afirma na sociedade e que se transforma, pela garantia do direito, em direito subjetivo, isto é, liberdade e poder jurídico”25. Na realidade, direito subjetivo e direito objetivo são aspectos da mesma realidade, que pode ser encarada de uma ou de outra forma. Direito subjetivo é a expressão da vontade individual, e direito objetivo é a expressão da vontade geral. Não somente a vontade, ou apenas o interesse, configura o direito subjetivo. Trata-se de um poder atribuído à vontade do indivíduo, para a satisfação dos seus próprios interesses protegidos pela lei, ou seja, pelo direito objetivo. 5. Direito público e direito privado Embora a divisão do direito objetivo em público e privado remonte ao direito romano, até hoje não há consenso sobre seus traços diferenciadores. Vários critérios foram propostos, com base no interesse, na utilidade, no sujeito, na finalidade da norma, no ius imperium, sem que todos eles estejam imunes a críticas. Essa dicotomia tem sua origem no direito romano, como se depreende das palavras de Ulpiano: “Direito público é o que corresponde às coisas do Estado; direito privado, o que pertence à utilidade das pessoas”26. Pelo critério adotado, da utilidade ou do interesse visado pela norma, o direito público era o direito do Estado romano, o que dizia respeito aos negócios de interesse deste. O direito privado, por sua vez, era o que disciplinava os interesses particulares, dos cidadãos. Malgrado o direito público vise proteger os interesses da sociedade e o direito privado busque assegurar, integralmente, a satisfação dos interesses individuais, tal critério se mostra insuficiente. Não se pode, com efeito, dissociar o interesse público do interesse privado, como se fossem antagônicos, mesmo porque, na maioria das vezes, torna-se difícil distinguir o interesse protegido. As normas não costumam atingir apenas o interesse do Estado ou do particular, mas entrelaçam-se e interpenetram-se. Destinam-se elas, em sua generalidade, à proteção de todos os interesses. Os dos particulares são também de natureza pública, tendo em vista o bem comum, e vice-versa. Tem-se apontado também a natureza do sujeito ou titular da relação jurídica como elemento diferenciador. Segundo esse critério, público é o direito que regula as relações do Estado com outro Estado, ou as do Estado com os cidadãos, e privado o que disciplina as relações entre os indivíduos como tais, nas quais predomina imediatamente o interesse de ordem particular. O fator subjetivo, entretanto, também é insatisfatório para fundamentar a distinção. Basta lembrar que o Estado coloca-se muitas vezes no mesmo plano dos particulares, submetendo-se às normas de direito privado. Não perde a natureza de norma de direito privado a que rege um negócio jurídico celebrado entre o Estado e o particular (a venda de bens dominicais, p. ex.) que com ele contratou, nem deixa de ser de ordem pública determinado preceito somente por disciplinar uma relação jurídica entre pessoas naturais. O critério finalístico assenta-se no interesse jurídico tutelado. Assim, são de direito público as normas em que predomina o interesse geral; e de direito privado as que visam atender imediatamente o interesse dos indivíduos. Tal teoria constitui uma revivescência da distinção romana e ignora que toda norma tem um escopo geral, ainda quando posta a serviço dos interesses particulares, e, principalmente, que certas normas de interesse geral inserem-se no direito privado, como as concernentes ao direito da família, por exemplo27. Teoria que desfruta de boa aceitação é a do ius imperium, para a qual o direito público regula as relações do Estado e de outras entidades com poder de autoridade, enquanto o direito privado disciplina as relações particulares entre si, com base na igualdade jurídica e no poder de autodeterminação. Objeta-se que, no entanto, todos são iguais perante o direito. Ademais, no direito privado também há relações jurídicas de subordinação, como, por exemplo, as existentes entre pai e filhos, entre curador e curatelado etc. Caio Mário da Silva Pereira28 considera satisfatória a associação do fator objetivo ao elemento subjetivo, feita por Ruggiero29: “Público é o direito que tem por finalidade regular as relações do Estado com outro Estado, ou as do Estado com seus súditos, quando procede em razão do poder soberano, e atua na tutela do bem coletivo; direito privado é o que disciplina as relações entre pessoas singulares, nas quais predomina imediatamente o interesse de ordem particular”. Consistindo, todavia, tal concepção na conjugação das teorias anteriormente examinadas, merece a mesma crítica a elas feita. Na realidade, o direito deve ser visto como um todo, sendo dividido em direito público e privado somente por motivos didáticos. A interpenetração de suas normas é comum, encontrando-se com frequência nos diplomas reguladores dos direitos privados as atinentes ao direito público e vice-versa. Do direito civil, que é o cerne do direito privado, destacaram-se outros ramos, especialmente o direito comercial, o direito do trabalho, o direito do consumidor e o direito agrário. Integram, hoje, o direito privado: o direito civil, o direito comercial, o direito agrário, o direito marítimo, bem como o direito do trabalho, o direito do consumidor e o direito aeronáutico. Estes últimos, malgrado contenham um expressivo elenco de normas de ordem pública, conservam a natureza privada, uma vez que tratam das relações entre particulares em geral. Registre-se, no entanto, a existência de corrente divergente que os coloca no elenco do direito público, especialmente o direito do trabalho. Orlando Gomes inclusive menciona quatro correntes de opinião que tratam do problema da localização deste último ramo do direito30. Pertencem ao direito público, por outro lado, o direito constitucional, o direito administrativo, o direito tributário, o direito penal, o direito processual (civil e penal), o direito internacional (público e privado) e o direito ambiental. Digno de nota o fenômeno, que se vem desenvolvendo atualmente, da acentuada interferência do direito público em relações jurídicas até agora disciplinadas no Código Civil, como as contratuais e as concernentes ao direito de propriedade, por exemplo. Tal interferência foi observada inicialmente na legislação especial (Estatuto da Criança e do Adolescente, Lei das Locações, Código de Defesa do Consumidor etc.) e, posteriormente, na própria Constituição Federal de 1988, a ponto de se afirmar hoje que a unidade do sistema deve ser buscada, deslocando para a tábua axiológica da Carta da República o ponto de referência antes localizado no Código Civil31. Normas de ordem pública são as cogentes, de aplicação obrigatória. São as que se impõem de modo absoluto, não sendo possível a sua derrogação pela vontade das partes. Normas de ordem privada são as que vigoram enquanto a vontade dos interessados não convencionar de forma diversa, tendo, pois, caráter supletivo. Distinguem-se em dispositivas, “quando permitem que os sujeitos disponham como lhes aprouver”, e supletivas, “quando se aplicam na falta de regulamentação privada, preenchendo, no exercício de uma função integradora, as lacunas por ela deixadas”32. No direito civil predominam as normas de ordem privada, malgrado existam também normas imperativas, de ordem pública, em elevada proporção, no direito de família, no das sucessões e nos direitos reais. As normas supletivas são encontradas principalmente no direito das obrigações, sendo aplicadas na ausência de manifestação das partes (CC, arts. 244 e 252, p. ex.). 6. A unificação do direito privado Desde o final do século XIX se observa uma tendência para unificar o direito privado e, assim, disciplinar conjunta e uniformemente o direito civil e o direito comercial. Na Itália, defenderam a ideia Vivante e Cimbali, dentre outros. Entre nós, o movimento encontrou apoio em Teixeira de Freitas, que chegou a propor ao Governo, na ocasião em que concluía o seu célebre Esboço do Código Civil, que se fizesse um Código de Direito Privado, em vez de um Código de Direito Civil. Alguns países tiveram experiências satisfatórias com a unificação, como a Suíça, Canadá, Itália e Polônia, por exemplo. Em verdade, não se justifica que um mesmo fenômeno jurídico, como a compra e venda e a prescrição, para citar apenas alguns, submeta-se a regras diferentes, de natureza civil e comercial. Por outro, as referidas experiências demonstraram que a uniformização deve abranger os princípios de aplicação comum a toda a matéria de direito privado, sem eliminar a específica à atividade mercantil, que prosseguiria constituindo objeto de especialização e autonomia. Desse modo, a melhor solução não parece ser a unificação do direito privado, mas sim a do direito obrigacional. Seriam, assim, mantidos os institutos característicos do direito comercial, os quais, mesmo enquadrados no direito privado unitário, manteriam sua fisionomia própria, como têm características peculiares os princípios inerentes aos diversos ramos do direito civil, no direito de família, das sucessões, das obrigações ou das coisas33. No Brasil, Orozimbo Nonato, Filadelfo Azevedo e Hahnemann Guimarães apresentaram o seu Anteprojeto de Código de Obrigações em 1941, no qual fixaram os princípios gerais do direito obrigacional, comuns a todo o direito privado, abrangentes da matéria mercantil. Algum tempo depois, Francisco Campos, encarregado da redação de um projeto de Código Comercial, anuncia sua adesão à tese unificadora. Também Caio Mário da Silva Pereira, incumbido de elaborar um Projeto de Código de Obrigações, em 1961, perfilhou a unificação34. Arnoldo Wald assevera que “o novo Código Civil unificou o direito privado, a exemplo do que ocorre no direito civil italiano, ao dispor sobre os títulos de crédito (arts. 887 a 926), do direito de empresa (arts. 966 a 1.195), em que trata, dentre outros temas, das várias espécies de sociedade”35. Miguel Reale rebate, contudo, a assertiva, dizendo que é preciso “corrigir, desde logo, um equívoco que consiste em dizer que tentamos estabelecer a unidade do Direito Privado. Esse não foi o objetivo visado. O que na realidade se fez foi consolidar e aperfeiçoar o que já estava sendo seguido no País, que era a unidade do Direito das Obrigações. Como o Código Comercial de 1850 se tornara completamente superado, não havia mais questões comerciais resolvidas à luz do Código de Comércio, mas sim em função do Código Civil. Na prática jurisprudencial, essa unidade das obrigações já era um fato consagrado, o que se refletiu na ideia rejeitada de um Código só para reger as obrigações, consoante projeto elaborado por jurisconsultos da estatura de Orozimbo Nonato, Hahnemann Guimarães e Philadelpho Azevedo”. Acrescentou o ilustre coordenador dos trabalhos da comissão que elaborou o projeto do novo diploma que “não vingou também a tentativa de, a um só tempo, elaborar um Código das Obrigações, de que foi relator Caio Mário da Silva Pereira, ao lado de um Código Civil, com a matéria restante, conforme projeto de Orlando Gomes. Depois dessas duas malogradas experiências, só restava manter a unidade da codificação, enriquecendo-a de novos elementos, levando em conta também as contribuições desses dois ilustres jurisconsultos”36. Em realidade, o novo Código Civil unificou as obrigações civis e mercantis, trazendo para o seu bojo a matéria constante da primeira parte do Código Comercial (CC, art. 2.045), procedendo, desse modo, a uma unificação parcial do direito privado.       1 Mazeaud e Mazeaud, Leçons de droit civil, v. 1, p. 33.   2 Caio Mário da Silva Pereira, Instituições de direito civil, v. 1, p. 3-4.   3 Washington de Barros Monteiro, Curso de direito civil, v. 1, p. 2.   4 Introducción a la filosofía del derecho, p. 47.   5 Curso, cit., v. 1, p. 1.   6 Francisco Amaral, Direito civil: introdução, p. 2.   7 Rubens Limongi França, Manual de direito civil, v. 1, p. 7.   8 Instituições, cit., v. 1, p. 5.   9 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 8; Silvio Rodrigues, Direito civil, v. 1, p. 4.   10 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 8.   11 Leçons, cit., v. 1, n. 14, p. 23.   12 Washington de Barros Monteiro, Curso, cit., v. 1, p. 4; Silvio Rodrigues, Direito civil, cit., v. 1, p. 6.   13 Andrea Torrente, Manuale di diritto privato, 1955, p. 4; Washington de Barros Monteiro, Curso, cit., v. 1, p. 8.   14 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 5.   15 Henri Capitant, Introduction à l’étude du droit civil, p. 8.   16 C. Massimo Bianca, Diritto civile, v. 1, p. 19. O direito natural “é o conjunto de princípios essenciais e permanentes atribuídos à Natureza (na antiguidade greco-romana), a Deus (na Idade Média), ou à razão humana (na época moderna) que serviriam de fundamento e legitimação ao direito positivo, o direito criado por uma vontade humana. Reconhece a existência desses dois direitos, e defende a sua superioridade quanto ao positivo” (Francisco Amaral, Direito civil, cit., p. 43).   17 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 6.   18 Ruggiero e Maroi, Istituzioni di diritto privato, v. 1, p. 8; Washington de Barros Monteiro, Curso, cit., v. 1, p. 8.   19 “Cheque. Emissão para pagamento de dívida de jogo. Inexigibilidade. O título emitido para pagamento de dívida de jogo não pode ser cobrado, posto que, para efeitos civis, a lei considera ato ilícito. Nulidade que não pode, porém, ser oposta ao terceiro de boa-fé” (RT, 670/94, 693/211, 696/199). “Cheque. Emissão para pagamento de dívida de jogo. Inexigibilidade. Irrelevância de a obrigação haver sido contraída em país em que é legítima a jogatina” (RT, 794/381).   20 Direito civil, cit., v. 1, p. 6-7.   21 Francisco Amaral, Direito civil, cit., p. 181.   22 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 10.   23 Rudolf von Ihering, L’esprit du droit romain, t. IV, p. 3.   24 Por outro lado, segundo pondera Francisco Amaral, “não se pode esquecer a coexistência de interesses diversos no próprio titular. No campo dos direitos de família, os interesses são da família, não dos titulares individualmente, e no campo da propriedade, a sua função social implica em poderes-deveres que não representam identidade de interesses. Há também uma série de interesses difusos, interesses coletivos de grupos ou coletividades, que não constituem propriamente direitos subjetivos” (Direito civil, cit., p. 188).   25 Luigi Ferri, L’autonomia privata, Milano, 1959, p. 249; Francisco Amaral, Direito civil, cit., p. 189.   26 “Ius publicum est quod ad statum rei romanae spectat; privatum, quod ad singulorum utilitatem” (Digesto, Livro I, título I, § 2º).   27 Francesco Ferrara, Trattato di diritto civile italiano, p. 74; Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 12.   28 Instituições, cit., v. 1, p. 13.   29 Roberto de Ruggiero, Instituições de direito civil, São Paulo, Saraiva, 1972, v. I, § 8º, p. 59.   30 Introdução ao direito civil, p. 18, n. 11.   31 Gustavo Tepedino, Premissas metodológicas para a constitucionalização do direito civil, in Temas de direito civil, p. 13.   32 “São imperativas (determinam uma ação) ou proibitivas (impõem uma abstenção). Regulam matéria de ordem pública e de bons costumes, entendendo-se como ordem pública o conjunto de normas que regulam os interesses fundamentais do Estado ou que estabelecem, no direito privado, as bases jurídicas da ordem econômica ou social” (Francisco Amaral, Direito civil, cit., p. 73; Henri de Page, Traité élémentaire de droit civil belge, v. 1, p. 113; Jacques Ghestin, Traité de droit civil: la formation du contrat, p. 104).   33 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 18; Arnoldo Wald, Curso de direito civil brasileiro: introdução e parte geral, v. 1, p. 15.   34 Instituições, cit., v. 1, p. 17.   35 Curso, cit., v. 1, p. 13.   36 O Projeto do novo Código Civil, p. 5. INTRODUÇÃO AO DIREITO CIVIL Capítulo I CONCEITO E DIVISÃO DO DIREITO Sumário: 1. Conceito de direito. 2. Distinção entre o direito e a moral. 3. Direito positivo e direito natural. 4. Direito objetivo e direito subjetivo. 5. Direito público e direito privado. 6. A unificação do direito privado. 1. Conceito de direito O homem é um ser eminentemente social. Não vive isolado, mas em grupos. A convivência impõe uma certa ordem, determinada por regras de conduta. Essa ordenação pressupõe a existência de restrições que limitam a atividade dos indivíduos componentes dos diversos grupos sociais. O fim do direito é precisamente determinar regras que permitam aos homens a vida em sociedade1. Em todo tempo, por mais distante que se olhe no passado, em qualquer agrupamento social, por mais rudimentar que seja, sempre se encontrará presente o fenômeno jurídico, representado pela observância de um mínimo de condições existenciais da vida em sociedade. Seja na unidade tribal em estado primitivo, seja na unidade estatal, sempre houve e haverá uma norma, uma regra de conduta pautando a atuação do indivíduo, nas suas relações com os outros indivíduos2. A ordem jurídica tem, assim, como premissa o estabelecimento dessas restrições, a determinação desses limites aos indivíduos, aos quais todos indistintamente devem se submeter, para que se torne possível a coexistência social3. Não há um consenso sobre o conceito do direito. A esse respeito divergem juristas, filósofos e sociólogos, desde tempos remotos. Deixando de lado as várias escolas e correntes existentes, apontamos como ideal, pela concisão e clareza, a definição de Radbruch4, citada por Washington de Barros Monteiro5, segundo a qual direito “é o conjunto das normas gerais e positivas, que regulam a vida social”. A palavra “direito” é usada, na acepção comum, para designar o conjunto de regras com que se disciplina a vida em sociedade, regras essas que se caracterizam pelo caráter genérico, concernente à indistinta aplicação a todos os indivíduos, e jurídico, que as diferencia das demais regras de comportamento social e lhes confere eficácia garantida pelo Estado. As referidas normas de conduta encontram-se nas leis, nos costumes, na jurisprudência, nos princípios gerais do direito, constituindo o direito objetivo e positivo, posto na sociedade por uma vontade superior6. Origina-se a palavra “direito” do latim directum, significando aquilo que é reto, que está de acordo com a lei. Os jurisconsultos romanos já relacionavam o direito com o que é justo. Da necessidade da justiça nas relações humanas é que nasce o direito. De outra parte, a criação do direito não tem outro objetivo senão a realização da justiça. No ensinamento de Aristóteles, aperfeiçoado pela filosofia escolástica, a justiça é a perpétua vontade de dar a cada um o que é seu, segundo uma igualdade7. O direito nasceu junto com o homem que, por natureza, é um ser social. As normas de direito, como visto, asseguram as condições de equilíbrio da coexistência dos seres humanos, da vida em sociedade. Para Caio Mário da Silva Pereira, que prefere deixar de lado as concepções dos historicistas, dos normativistas, dos finalistas e dos sociólogos do direito, que não conseguiram fornecer uma definição satisfatória, o direito “é o princípio de adequação do homem à vida social. Está na lei, como exteriorização do comando do Estado; integra-se na consciência do indivíduo que pauta sua conduta pelo espiritualismo do seu elevado grau de moralidade; está no anseio de justiça, como ideal eterno do homem; está imanente na necessidade de contenção para a coexistência”8. Há marcante diferença entre o “ser” do mundo da natureza e o “dever ser” do mundo jurídico. Os fenômenos da natureza, sujeitos às leis físicas, são imutáveis, enquanto o mundo jurídico, o do “dever ser”, caracteriza-se pela liberdade na escolha da conduta. Direito, portanto, é a ciência do “dever ser”. 2. Distinção entre o direito e a moral A vida em sociedade exige a observância de outras normas, além das jurídicas. As pessoas devem pautar a sua conduta pela ética, de conteúdo mais abrangente do que o direito, porque ela compreende as normas jurídicas e as normas morais. Para desenvolver a espiritualidade e cultuar as santidades, as pessoas devem obedecer aos princípios religiosos. Para gozar de boa saúde, devem seguir os preceitos higiênicos. Para bem se relacionar e desfrutar de prestígio social, devem observar as regras de etiqueta e urbanidade etc.9. As normas jurídicas e morais têm em comum o fato de constituírem regras de comportamento. No entanto, distinguem-se precipuamente pela sanção (que no direito é imposta pelo Estado para constranger os indivíduos à observância da norma, e na moral somente pela consciência do homem, traduzida pelo remorso, pelo arrependimento, porém sem coerção) e pelo campo de ação, que na moral é mais amplo. Com efeito, as ações humanas interessam ao direito, mas nem sempre. Quando “são impostas ou proibidas, encontram sanção no ordenamento jurídico. São as normas jurídicas, são os princípios de direito. Quando se cumprem ou se descumprem sem que este interfira, vão buscar sanção no foro íntimo, no foro da consciência, até onde não chega a força cogente do Estado. É, porém, certo que o princípio moral envolve a norma jurídica, podendo-se dizer que, geralmente, a ação juridicamente condenável o é também pela moral. Mas a coincidência não é absoluta”10. Desse modo, nem tudo que é moral é jurídico, pois a justiça é apenas uma parte do objeto da moral. É célebre, neste aspecto, a comparação de Bentham, utilizando-se de dois círculos concêntricos, dos quais a circunferência representativa do campo da moral se mostra mais ampla, contendo todas as normas reguladoras da vida em sociedade. O círculo menor, que representa o direito, abrange somente aquelas dotadas de força coercitiva. A principal diferença entre a regra moral e a regra jurídica repousa efetivamente na sanção. Pode-se afirmar que direito e moral distinguem-se, ainda, pelo fato de o primeiro atuar no foro exterior, ensejando medidas repressivas do aparelho estatal quando violado, e a segunda no foro íntimo das pessoas, encontrando reprovação na sua consciência. Sob outro aspecto, afirmam os irmãos Mazeaud que a moral procura fazer que reine não apenas a justiça, mas também a caridade, que tende ao aperfeiçoamento individual11. Algumas vezes tem acontecido de o direito trazer para sua esfera de atuação preceitos da moral, considerados merecedores de sanção mais eficaz, pois malgrado diversos os seus campos de atuação, entrelaçam-se e interpenetram-se de mil maneiras. Podem ser lembrados, a título de exemplos, o art. 17 da Lei de Introdução ao Código Civil (atual Lei de Introdução às Normas do Direito Brasileiro, conforme estabelecido na Lei n. 12.376, de 30-12-2010) e os arts. 557, 1.638 e 1.735, V, todos do Código Civil. Há mesmo uma tendência das normas morais a converter-se em normas jurídicas, como ocorreu, exemplificativamente, com o dever do pai de velar pelo filho, com a indenização por acidente do trabalho e por despedimento do empregado, com a obrigação de dar a este aviso prévio etc.12. 3. Direito positivo e direito natural Direito positivo é o ordenamento jurídico em vigor num determinado país e numa determinada época (jus in civitate positum). Direito natural é a ideia abstrata do direito, o ordenamento ideal, correspondente a uma justiça superior e suprema13. O direito positivo, em outras palavras, é o “conjunto de princípios que pautam a vida social de determinado povo em determinada época”, sendo nesta acepção que nos referimos ao direito romano, ao direito inglês, ao direito alemão, ao direito brasileiro etc., não importando seja escrito ou não escrito, de elaboração sistemática ou de formação jurisprudencial14. Segundo Capitant, é o que está em vigor num povo determinado, e compreende toda a disciplina da conduta, abrangendo as leis votadas pelo poder competente, os regulamentos, as disposições normativas de qualquer espécie. O fundamento de sua existência está ligado ao conceito de vigência15. Na época moderna, o direito natural desenvolve-se sob o nome de jusnaturalismo, sendo visto como “expressão de princípios superiores ligados à natureza racional e social do homem”16. O jusnaturalismo foi defendido por Santo Agostinho e São Tomás de Aquino, bem como pelos doutores da Igreja e pensadores dos séculos XVII e XVIII. Hugo Grócio, já no século XVI, defendia a existência de um direito ideal e eterno, ao lado do direito positivo, sendo considerado o fundador da nova Escola de Direito Natural. A Escola Histórica e a Escola Positivista, entretanto, refutam o jusnaturalismo, atendo-se à realidade concreta do direito positivo. No século XIX, renasceu e predominou a ideia jusnaturalista, especialmente em razão do movimento neotomista e da ideia neokantiana. É realmente inegável a existência de leis anteriores e inspiradoras do direito positivo, as quais, mesmo não escritas, encontram-se na consciência dos povos. Malgrado a aparente antinomia, não se pode falar em contraposição entre ambos, pois que, “se um é a fonte de inspiração do outro, não exprimem ideias antagônicas, mas, ao revés, tendem a uma convergência ideológica, ou, ao menos, devem procurá-la, o direito positivo amparando-se na sujeição ao direito natural para que a regra realize o ideal, e o direito natural inspirando o direito positivo para que este se aproxime da perfeição”17. Na realidade, o direito natural, a exemplo do que sucede com as normas morais, tende a converter-se em direito positivo, ou a modificar o direito preexistente18. Para o direito positivo não é exigível o pagamento de dívida prescrita e de dívida de jogo (arts. 814 e 882)19. Mas para o direito natural esse pagamento é obrigatório. 4. Direito objetivo e direito subjetivo Direito objetivo é o conjunto de normas impostas pelo Estado, de caráter geral, a cuja inobservância os indivíduos podem ser compelidos mediante coerção. Esse conjunto de regras jurídicas comportamentais (norma agendi) gera para os indivíduos a faculdade de satisfazer determinadas pretensões e de praticar os atos destinados a alcançar tais objetivos (facultas agendi). Encarado sob esse aspecto, denomina-se direito subjetivo, que nada mais é do que a faculdade individual de agir de acordo com o direito objetivo, de invocar a sua proteção. Silvio Rodrigues, com precisão, esclarece: “O fenômeno jurídico, embora seja um só, pode ser encarado sob mais de um ângulo. Vendo-o como um conjunto de normas que a todos se dirige e a todos vincula, temos o direito objetivo. É a norma da ação humana, isto é, a norma agendi. Se, entretanto, o observador encara o fenômeno através da prerrogativa que para o indivíduo decorre da norma, tem-se o direito subjetivo. Trata-se da faculdade conferida ao indivíduo de invocar a norma em seu favor, ou seja, da faculdade de agir sob a sombra da regra, isto é, a facultas agendi”20. Direito subjetivo é “o poder que a ordem jurídica confere a alguém de agir e de exigir de outrem determinado comportamento”21. É, portanto, o meio de satisfazer interesses humanos e deriva do direito objetivo, nascendo com ele. Se o direito objetivo é modificado, altera-se o direito subjetivo. Podemos dizer que há referência ao direito objetivo quando se diz, por exemplo, que “o direito impõe a todos o respeito à propriedade”; e que é feita alusão ao direito subjetivo quando se proclama que “o proprietário tem o direito de repelir a agressão à coisa que lhe pertence”.22 As teorias de Duguit e de Kelsen (Teoria Pura do Direito) integram as doutrinas negativistas, que não admitem a existência do direito subjetivo. Para Kelsen, a obrigação jurídica não é senão a própria norma jurídica. Sendo assim, o direito subjetivo não é senão o direito objetivo. Reconhece ele somente a existência deste, não aceitando o dualismo direito objetivo-direito subjetivo, que encerra um componente ideológico. Predominam, no entanto, as doutrinas afirmativas, que reconhecem a existência do direito subjetivo, tanto no aspecto técnico como do ponto de vista histórico. Essas doutrinas se desdobram em: a) teoria da vontade; b) teoria do interesse; e c) teoria mista. Para a teoria da vontade, de Savigny, Windscheid e outros, o direito subjetivo constitui um poder da vontade reconhecido pela ordem jurídica. O Estado somente intervém quando estritamente necessário. Nesse caso, o titular do direito é o único juiz da conveniência de sua utilização. Todavia, há direitos em que não existe uma vontade real do seu titular. Os incapazes, por exemplo, têm direito subjetivo, podendo herdar, ser proprietários, embora não possuam vontade em sentido jurídico. Para a teoria do interesse, defendida por Ihering, direito subjetivo é o interesse juridicamente protegido23. Ambas as teorias são passíveis de críticas. Não se pode aceitar que o direito subjetivo, sendo um poder conferido a alguém pelo ordenamento jurídico, dependa da vontade do titular para ter eficácia. Na realidade, ele existe e é eficaz independentemente do interesse deste. A teoria de Ihering, que considera direito subjetivo o “interesse juridicamente protegido”, é também criticável, pois confunde o direito subjetivo com o seu conteúdo24. A teoria mista, ou eclética, conjuga o elemento vontade com o elemento interesse. Jellinek o define como o interesse protegido que a vontade tem o poder de realizar. Consistindo na reunião dos elementos básicos das duas teorias anteriormente mencionadas, a vontade e o interesse, merecem também as mesmas críticas. O direito subjetivo, em verdade, não constitui nem poder da vontade, nem interesse protegido, mas apenas “um poder de agir e de exigir determinado comportamento para a realização de um interesse, pressupondo a existência de uma relação jurídica. Seu fundamento é a autonomia dos sujeitos, a liberdade natural que se afirma na sociedade e que se transforma, pela garantia do direito, em direito subjetivo, isto é, liberdade e poder jurídico”25. Na realidade, direito subjetivo e direito objetivo são aspectos da mesma realidade, que pode ser encarada de uma ou de outra forma. Direito subjetivo é a expressão da vontade individual, e direito objetivo é a expressão da vontade geral. Não somente a vontade, ou apenas o interesse, configura o direito subjetivo. Trata-se de um poder atribuído à vontade do indivíduo, para a satisfação dos seus próprios interesses protegidos pela lei, ou seja, pelo direito objetivo. 5. Direito público e direito privado Embora a divisão do direito objetivo em público e privado remonte ao direito romano, até hoje não há consenso sobre seus traços diferenciadores. Vários critérios foram propostos, com base no interesse, na utilidade, no sujeito, na finalidade da norma, no ius imperium, sem que todos eles estejam imunes a críticas. Essa dicotomia tem sua origem no direito romano, como se depreende das palavras de Ulpiano: “Direito público é o que corresponde às coisas do Estado; direito privado, o que pertence à utilidade das pessoas”26. Pelo critério adotado, da utilidade ou do interesse visado pela norma, o direito público era o direito do Estado romano, o que dizia respeito aos negócios de interesse deste. O direito privado, por sua vez, era o que disciplinava os interesses particulares, dos cidadãos. Malgrado o direito público vise proteger os interesses da sociedade e o direito privado busque assegurar, integralmente, a satisfação dos interesses individuais, tal critério se mostra insuficiente. Não se pode, com efeito, dissociar o interesse público do interesse privado, como se fossem antagônicos, mesmo porque, na maioria das vezes, torna-se difícil distinguir o interesse protegido. As normas não costumam atingir apenas o interesse do Estado ou do particular, mas entrelaçam-se e interpenetram-se. Destinam-se elas, em sua generalidade, à proteção de todos os interesses. Os dos particulares são também de natureza pública, tendo em vista o bem comum, e vice-versa. Tem-se apontado também a natureza do sujeito ou titular da relação jurídica como elemento diferenciador. Segundo esse critério, público é o direito que regula as relações do Estado com outro Estado, ou as do Estado com os cidadãos, e privado o que disciplina as relações entre os indivíduos como tais, nas quais predomina imediatamente o interesse de ordem particular. O fator subjetivo, entretanto, também é insatisfatório para fundamentar a distinção. Basta lembrar que o Estado coloca-se muitas vezes no mesmo plano dos particulares, submetendo-se às normas de direito privado. Não perde a natureza de norma de direito privado a que rege um negócio jurídico celebrado entre o Estado e o particular (a venda de bens dominicais, p. ex.) que com ele contratou, nem deixa de ser de ordem pública determinado preceito somente por disciplinar uma relação jurídica entre pessoas naturais. O critério finalístico assenta-se no interesse jurídico tutelado. Assim, são de direito público as normas em que predomina o interesse geral; e de direito privado as que visam atender imediatamente o interesse dos indivíduos. Tal teoria constitui uma revivescência da distinção romana e ignora que toda norma tem um escopo geral, ainda quando posta a serviço dos interesses particulares, e, principalmente, que certas normas de interesse geral inserem-se no direito privado, como as concernentes ao direito da família, por exemplo27. Teoria que desfruta de boa aceitação é a do ius imperium, para a qual o direito público regula as relações do Estado e de outras entidades com poder de autoridade, enquanto o direito privado disciplina as relações particulares entre si, com base na igualdade jurídica e no poder de autodeterminação. Objeta-se que, no entanto, todos são iguais perante o direito. Ademais, no direito privado também há relações jurídicas de subordinação, como, por exemplo, as existentes entre pai e filhos, entre curador e curatelado etc. Caio Mário da Silva Pereira28 considera satisfatória a associação do fator objetivo ao elemento subjetivo, feita por Ruggiero29: “Público é o direito que tem por finalidade regular as relações do Estado com outro Estado, ou as do Estado com seus súditos, quando procede em razão do poder soberano, e atua na tutela do bem coletivo; direito privado é o que disciplina as relações entre pessoas singulares, nas quais predomina imediatamente o interesse de ordem particular”. Consistindo, todavia, tal concepção na conjugação das teorias anteriormente examinadas, merece a mesma crítica a elas feita. Na realidade, o direito deve ser visto como um todo, sendo dividido em direito público e privado somente por motivos didáticos. A interpenetração de suas normas é comum, encontrando-se com frequência nos diplomas reguladores dos direitos privados as atinentes ao direito público e vice-versa. Do direito civil, que é o cerne do direito privado, destacaram-se outros ramos, especialmente o direito comercial, o direito do trabalho, o direito do consumidor e o direito agrário. Integram, hoje, o direito privado: o direito civil, o direito comercial, o direito agrário, o direito marítimo, bem como o direito do trabalho, o direito do consumidor e o direito aeronáutico. Estes últimos, malgrado contenham um expressivo elenco de normas de ordem pública, conservam a natureza privada, uma vez que tratam das relações entre particulares em geral. Registre-se, no entanto, a existência de corrente divergente que os coloca no elenco do direito público, especialmente o direito do trabalho. Orlando Gomes inclusive menciona quatro correntes de opinião que tratam do problema da localização deste último ramo do direito30. Pertencem ao direito público, por outro lado, o direito constitucional, o direito administrativo, o direito tributário, o direito penal, o direito processual (civil e penal), o direito internacional (público e privado) e o direito ambiental. Digno de nota o fenômeno, que se vem desenvolvendo atualmente, da acentuada interferência do direito público em relações jurídicas até agora disciplinadas no Código Civil, como as contratuais e as concernentes ao direito de propriedade, por exemplo. Tal interferência foi observada inicialmente na legislação especial (Estatuto da Criança e do Adolescente, Lei das Locações, Código de Defesa do Consumidor etc.) e, posteriormente, na própria Constituição Federal de 1988, a ponto de se afirmar hoje que a unidade do sistema deve ser buscada, deslocando para a tábua axiológica da Carta da República o ponto de referência antes localizado no Código Civil31. Normas de ordem pública são as cogentes, de aplicação obrigatória. São as que se impõem de modo absoluto, não sendo possível a sua derrogação pela vontade das partes. Normas de ordem privada são as que vigoram enquanto a vontade dos interessados não convencionar de forma diversa, tendo, pois, caráter supletivo. Distinguem-se em dispositivas, “quando permitem que os sujeitos disponham como lhes aprouver”, e supletivas, “quando se aplicam na falta de regulamentação privada, preenchendo, no exercício de uma função integradora, as lacunas por ela deixadas”32. No direito civil predominam as normas de ordem privada, malgrado existam também normas imperativas, de ordem pública, em elevada proporção, no direito de família, no das sucessões e nos direitos reais. As normas supletivas são encontradas principalmente no direito das obrigações, sendo aplicadas na ausência de manifestação das partes (CC, arts. 244 e 252, p. ex.). 6. A unificação do direito privado Desde o final do século XIX se observa uma tendência para unificar o direito privado e, assim, disciplinar conjunta e uniformemente o direito civil e o direito comercial. Na Itália, defenderam a ideia Vivante e Cimbali, dentre outros. Entre nós, o movimento encontrou apoio em Teixeira de Freitas, que chegou a propor ao Governo, na ocasião em que concluía o seu célebre Esboço do Código Civil, que se fizesse um Código de Direito Privado, em vez de um Código de Direito Civil. Alguns países tiveram experiências satisfatórias com a unificação, como a Suíça, Canadá, Itália e Polônia, por exemplo. Em verdade, não se justifica que um mesmo fenômeno jurídico, como a compra e venda e a prescrição, para citar apenas alguns, submeta-se a regras diferentes, de natureza civil e comercial. Por outro, as referidas experiências demonstraram que a uniformização deve abranger os princípios de aplicação comum a toda a matéria de direito privado, sem eliminar a específica à atividade mercantil, que prosseguiria constituindo objeto de especialização e autonomia. Desse modo, a melhor solução não parece ser a unificação do direito privado, mas sim a do direito obrigacional. Seriam, assim, mantidos os institutos característicos do direito comercial, os quais, mesmo enquadrados no direito privado unitário, manteriam sua fisionomia própria, como têm características peculiares os princípios inerentes aos diversos ramos do direito civil, no direito de família, das sucessões, das obrigações ou das coisas33. No Brasil, Orozimbo Nonato, Filadelfo Azevedo e Hahnemann Guimarães apresentaram o seu Anteprojeto de Código de Obrigações em 1941, no qual fixaram os princípios gerais do direito obrigacional, comuns a todo o direito privado, abrangentes da matéria mercantil. Algum tempo depois, Francisco Campos, encarregado da redação de um projeto de Código Comercial, anuncia sua adesão à tese unificadora. Também Caio Mário da Silva Pereira, incumbido de elaborar um Projeto de Código de Obrigações, em 1961, perfilhou a unificação34. Arnoldo Wald assevera que “o novo Código Civil unificou o direito privado, a exemplo do que ocorre no direito civil italiano, ao dispor sobre os títulos de crédito (arts. 887 a 926), do direito de empresa (arts. 966 a 1.195), em que trata, dentre outros temas, das várias espécies de sociedade”35. Miguel Reale rebate, contudo, a assertiva, dizendo que é preciso “corrigir, desde logo, um equívoco que consiste em dizer que tentamos estabelecer a unidade do Direito Privado. Esse não foi o objetivo visado. O que na realidade se fez foi consolidar e aperfeiçoar o que já estava sendo seguido no País, que era a unidade do Direito das Obrigações. Como o Código Comercial de 1850 se tornara completamente superado, não havia mais questões comerciais resolvidas à luz do Código de Comércio, mas sim em função do Código Civil. Na prática jurisprudencial, essa unidade das obrigações já era um fato consagrado, o que se refletiu na ideia rejeitada de um Código só para reger as obrigações, consoante projeto elaborado por jurisconsultos da estatura de Orozimbo Nonato, Hahnemann Guimarães e Philadelpho Azevedo”. Acrescentou o ilustre coordenador dos trabalhos da comissão que elaborou o projeto do novo diploma que “não vingou também a tentativa de, a um só tempo, elaborar um Código das Obrigações, de que foi relator Caio Mário da Silva Pereira, ao lado de um Código Civil, com a matéria restante, conforme projeto de Orlando Gomes. Depois dessas duas malogradas experiências, só restava manter a unidade da codificação, enriquecendo-a de novos elementos, levando em conta também as contribuições desses dois ilustres jurisconsultos”36. Em realidade, o novo Código Civil unificou as obrigações civis e mercantis, trazendo para o seu bojo a matéria constante da primeira parte do Código Comercial (CC, art. 2.045), procedendo, desse modo, a uma unificação parcial do direito privado. 1 Mazeaud e Mazeaud, Leçons de droit civil, v. 1, p. 33.   2 Caio Mário da Silva Pereira, Instituições de direito civil, v. 1, p. 3-4.   3 Washington de Barros Monteiro, Curso de direito civil, v. 1, p. 2.   4 Introducción a la filosofía del derecho, p. 47.   5 Curso, cit., v. 1, p. 1.   6 Francisco Amaral, Direito civil: introdução, p. 2.   7 Rubens Limongi França, Manual de direito civil, v. 1, p. 7.   8 Instituições, cit., v. 1, p. 5.   9 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 8; Silvio Rodrigues, Direito civil, v. 1, p. 4.   10 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 8.   11 Leçons, cit., v. 1, n. 14, p. 23.   12 Washington de Barros Monteiro, Curso, cit., v. 1, p. 4; Silvio Rodrigues, Direito civil, cit., v. 1, p. 6.   13 Andrea Torrente, Manuale di diritto privato, 1955, p. 4; Washington de Barros Monteiro, Curso, cit., v. 1, p. 8.   14 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 5.   15 Henri Capitant, Introduction à l’étude du droit civil, p. 8.   16 C. Massimo Bianca, Diritto civile, v. 1, p. 19. O direito natural “é o conjunto de princípios essenciais e permanentes atribuídos à Natureza (na antiguidade greco-romana), a Deus (na Idade Média), ou à razão humana (na época moderna) que serviriam de fundamento e legitimação ao direito positivo, o direito criado por uma vontade humana. Reconhece a existência desses dois direitos, e defende a sua superioridade quanto ao positivo” (Francisco Amaral, Direito civil, cit., p. 43).   17 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 6.   18 Ruggiero e Maroi, Istituzioni di diritto privato, v. 1, p. 8; Washington de Barros Monteiro, Curso, cit., v. 1, p. 8.   19 “Cheque. Emissão para pagamento de dívida de jogo. Inexigibilidade. O título emitido para pagamento de dívida de jogo não pode ser cobrado, posto que, para efeitos civis, a lei considera ato ilícito. Nulidade que não pode, porém, ser oposta ao terceiro de boa-fé” (RT, 670/94, 693/211, 696/199). “Cheque. Emissão para pagamento de dívida de jogo. Inexigibilidade. Irrelevância de a obrigação haver sido contraída em país em que é legítima a jogatina” (RT, 794/381).   20 Direito civil, cit., v. 1, p. 6-7.   21 Francisco Amaral, Direito civil, cit., p. 181.   22 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 10.   23 Rudolf von Ihering, L’esprit du droit romain, t. IV, p. 3.   24 Por outro lado, segundo pondera Francisco Amaral, “não se pode esquecer a coexistência de interesses diversos no próprio titular. No campo dos direitos de família, os interesses são da família, não dos titulares individualmente, e no campo da propriedade, a sua função social implica em poderes-deveres que não representam identidade de interesses. Há também uma série de interesses difusos, interesses coletivos de grupos ou coletividades, que não constituem propriamente direitos subjetivos” (Direito civil, cit., p. 188).   25 Luigi Ferri, L’autonomia privata, Milano, 1959, p. 249; Francisco Amaral, Direito civil, cit., p. 189.   26 “Ius publicum est quod ad statum rei romanae spectat; privatum, quod ad singulorum utilitatem” (Digesto, Livro I, título I, § 2º).   27 Francesco Ferrara, Trattato di diritto civile italiano, p. 74; Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 12.   28 Instituições, cit., v. 1, p. 13.   29 Roberto de Ruggiero, Instituições de direito civil, São Paulo, Saraiva, 1972, v. I, § 8º, p. 59.   30 Introdução ao direito civil, p. 18, n. 11.   31 Gustavo Tepedino, Premissas metodológicas para a constitucionalização do direito civil, in Temas de direito civil, p. 13.   32 “São imperativas (determinam uma ação) ou proibitivas (impõem uma abstenção). Regulam matéria de ordem pública e de bons costumes, entendendo-se como ordem pública o conjunto de normas que regulam os interesses fundamentais do Estado ou que estabelecem, no direito privado, as bases jurídicas da ordem econômica ou social” (Francisco Amaral, Direito civil, cit., p. 73; Henri de Page, Traité élémentaire de droit civil belge, v. 1, p. 113; Jacques Ghestin, Traité de droit civil: la formation du contrat, p. 104).   33 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 18; Arnoldo Wald, Curso de direito civil brasileiro: introdução e parte geral, v. 1, p. 15.   34 Instituições, cit., v. 1, p. 17.   35 Curso, cit., v. 1, p. 13.   36 O Projeto do novo Código Civil, p. 5. 1 Mazeaud e Mazeaud, Leçons de droit civil, v. 1, p. 33. 1 Mazeaud e Mazeaud, Leçons de droit civil, v. 1, p. 33. 2 Caio Mário da Silva Pereira, Instituições de direito civil, v. 1, p. 3-4. 2 Caio Mário da Silva Pereira, Instituições de direito civil, v. 1, p. 3-4. 3 Washington de Barros Monteiro, Curso de direito civil, v. 1, p. 2. 3 Washington de Barros Monteiro, Curso de direito civil, v. 1, p. 2. 4 Introducción a la filosofía del derecho, p. 47. 4 Introducción a la filosofía del derecho, p. 47. 5 Curso, cit., v. 1, p. 1. 5 Curso, cit., v. 1, p. 1. 6 Francisco Amaral, Direito civil: introdução, p. 2. 6 Francisco Amaral, Direito civil: introdução, p. 2. 7 Rubens Limongi França, Manual de direito civil, v. 1, p. 7. 7 Rubens Limongi França, Manual de direito civil, v. 1, p. 7. 8 Instituições, cit., v. 1, p. 5. 8 Instituições, cit., v. 1, p. 5. 9 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 8; Silvio Rodrigues, Direito civil, v. 1, p. 4. 9 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 8; Silvio Rodrigues, Direito civil, v. 1, p. 4. 10 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 8. 10 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 8. 11 Leçons, cit., v. 1, n. 14, p. 23. 11 Leçons, cit., v. 1, n. 14, p. 23. 12 Washington de Barros Monteiro, Curso, cit., v. 1, p. 4; Silvio Rodrigues, Direito civil, cit., v. 1, p. 6. 12 Washington de Barros Monteiro, Curso, cit., v. 1, p. 4; Silvio Rodrigues, Direito civil, cit., v. 1, p. 6. 13 Andrea Torrente, Manuale di diritto privato, 1955, p. 4; Washington de Barros Monteiro, Curso, cit., v. 1, p. 8. 13 Andrea Torrente, Manuale di diritto privato, 1955, p. 4; Washington de Barros Monteiro, Curso, cit., v. 1, p. 8. 14 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 5. 14 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 5. 15 Henri Capitant, Introduction à l’étude du droit civil, p. 8. 15 Henri Capitant, Introduction à l’étude du droit civil, p. 8. 16 C. Massimo Bianca, Diritto civile, v. 1, p. 19. O direito natural “é o conjunto de princípios essenciais e permanentes atribuídos à Natureza (na antiguidade greco-romana), a Deus (na Idade Média), ou à razão humana (na época moderna) que serviriam de fundamento e legitimação ao direito positivo, o direito criado por uma vontade humana. Reconhece a existência desses dois direitos, e defende a sua superioridade quanto ao positivo” (Francisco Amaral, Direito civil, cit., p. 43). 16 C. Massimo Bianca, Diritto civile, v. 1, p. 19. O direito natural “é o conjunto de princípios essenciais e permanentes atribuídos à Natureza (na antiguidade greco-romana), a Deus (na Idade Média), ou à razão humana (na época moderna) que serviriam de fundamento e legitimação ao direito positivo, o direito criado por uma vontade humana. Reconhece a existência desses dois direitos, e defende a sua superioridade quanto ao positivo” (Francisco Amaral, Direito civil, cit., p. 43). 17 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 6. 17 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 6. 18 Ruggiero e Maroi, Istituzioni di diritto privato, v. 1, p. 8; Washington de Barros Monteiro, Curso, cit., v. 1, p. 8. 18 Ruggiero e Maroi, Istituzioni di diritto privato, v. 1, p. 8; Washington de Barros Monteiro, Curso, cit., v. 1, p. 8. 19 “Cheque. Emissão para pagamento de dívida de jogo. Inexigibilidade. O título emitido para pagamento de dívida de jogo não pode ser cobrado, posto que, para efeitos civis, a lei considera ato ilícito. Nulidade que não pode, porém, ser oposta ao terceiro de boa-fé” (RT, 670/94, 693/211, 696/199). “Cheque. Emissão para pagamento de dívida de jogo. Inexigibilidade. Irrelevância de a obrigação haver sido contraída em país em que é legítima a jogatina” (RT, 794/381). 19 “Cheque. Emissão para pagamento de dívida de jogo. Inexigibilidade. O título emitido para pagamento de dívida de jogo não pode ser cobrado, posto que, para efeitos civis, a lei considera ato ilícito. Nulidade que não pode, porém, ser oposta ao terceiro de boa-fé” (RT, 670/94, 693/211, 696/199). “Cheque. Emissão para pagamento de dívida de jogo. Inexigibilidade. Irrelevância de a obrigação haver sido contraída em país em que é legítima a jogatina” (RT, 794/381). 20 Direito civil, cit., v. 1, p. 6-7. 20 Direito civil, cit., v. 1, p. 6-7. 21 Francisco Amaral, Direito civil, cit., p. 181. 21 Francisco Amaral, Direito civil, cit., p. 181. 22 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 10. 22 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 10. 23 Rudolf von Ihering, L’esprit du droit romain, t. IV, p. 3. 23 Rudolf von Ihering, L’esprit du droit romain, t. IV, p. 3. 24 Por outro lado, segundo pondera Francisco Amaral, “não se pode esquecer a coexistência de interesses diversos no próprio titular. No campo dos direitos de família, os interesses são da família, não dos titulares individualmente, e no campo da propriedade, a sua função social implica em poderes-deveres que não representam identidade de interesses. Há também uma série de interesses difusos, interesses coletivos de grupos ou coletividades, que não constituem propriamente direitos subjetivos” (Direito civil, cit., p. 188). 24 Por outro lado, segundo pondera Francisco Amaral, “não se pode esquecer a coexistência de interesses diversos no próprio titular. No campo dos direitos de família, os interesses são da família, não dos titulares individualmente, e no campo da propriedade, a sua função social implica em poderes-deveres que não representam identidade de interesses. Há também uma série de interesses difusos, interesses coletivos de grupos ou coletividades, que não constituem propriamente direitos subjetivos” (Direito civil, cit., p. 188). 25 Luigi Ferri, L’autonomia privata, Milano, 1959, p. 249; Francisco Amaral, Direito civil, cit., p. 189. 25 Luigi Ferri, L’autonomia privata, Milano, 1959, p. 249; Francisco Amaral, Direito civil, cit., p. 189. 26 “Ius publicum est quod ad statum rei romanae spectat; privatum, quod ad singulorum utilitatem” (Digesto, Livro I, título I, § 2º). 26 “Ius publicum est quod ad statum rei romanae spectat; privatum, quod ad singulorum utilitatem” (Digesto, Livro I, título I, § 2º). 27 Francesco Ferrara, Trattato di diritto civile italiano, p. 74; Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 12. 27 Francesco Ferrara, Trattato di diritto civile italiano, p. 74; Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 12. 28 Instituições, cit., v. 1, p. 13. 28 Instituições, cit., v. 1, p. 13. 29 Roberto de Ruggiero, Instituições de direito civil, São Paulo, Saraiva, 1972, v. I, § 8º, p. 59. 29 Roberto de Ruggiero, Instituições de direito civil, São Paulo, Saraiva, 1972, v. I, § 8º, p. 59. 30 Introdução ao direito civil, p. 18, n. 11. 30 Introdução ao direito civil, p. 18, n. 11. 31 Gustavo Tepedino, Premissas metodológicas para a constitucionalização do direito civil, in Temas de direito civil, p. 13. 31 Gustavo Tepedino, Premissas metodológicas para a constitucionalização do direito civil, in Temas de direito civil, p. 13. 32 “São imperativas (determinam uma ação) ou proibitivas (impõem uma abstenção). Regulam matéria de ordem pública e de bons costumes, entendendo-se como ordem pública o conjunto de normas que regulam os interesses fundamentais do Estado ou que estabelecem, no direito privado, as bases jurídicas da ordem econômica ou social” (Francisco Amaral, Direito civil, cit., p. 73; Henri de Page, Traité élémentaire de droit civil belge, v. 1, p. 113; Jacques Ghestin, Traité de droit civil: la formation du contrat, p. 104). 32 “São imperativas (determinam uma ação) ou proibitivas (impõem uma abstenção). Regulam matéria de ordem pública e de bons costumes, entendendo-se como ordem pública o conjunto de normas que regulam os interesses fundamentais do Estado ou que estabelecem, no direito privado, as bases jurídicas da ordem econômica ou social” (Francisco Amaral, Direito civil, cit., p. 73; Henri de Page, Traité élémentaire de droit civil belge, v. 1, p. 113; Jacques Ghestin, Traité de droit civil: la formation du contrat, p. 104). 33 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 18; Arnoldo Wald, Curso de direito civil brasileiro: introdução e parte geral, v. 1, p. 15. 33 Caio Mário da Silva Pereira, Instituições, cit., v. 1, p. 18; Arnoldo Wald, Curso de direito civil brasileiro: introdução e parte geral, v. 1, p. 15. 34 Instituições, cit., v. 1, p. 17. 34 Instituições, cit., v. 1, p. 17. 35 Curso, cit., v. 1, p. 13. 35 Curso, cit., v. 1, p. 13. 36 O Projeto do novo Código Civil, p. 5. 36 O Projeto do novo Código Civil, p. 5."
}
