{
    "nome": "LEI DE INTRODUÇÃO ÀS NORMAS DO DIREITO BRASILEIRO",
    "conteúdo": "1. Conteúdo e função A vigente Lei de Introdução ao Código Civil (Dec.-Lei n. 4.657, de 4-9-1942), atualmente denominada Lei de Introdução às Normas do Direito Brasileiro (Lei n. 12.376, de 30-12-2010), revogou a antiga, promulgada simultaneamente com o Código Civil, substituindo-a em todo o seu conteúdo. Contém dezenove artigos, enquanto a primitiva continha vinte e um. Trata-se de legislação anexa ao Código Civil, mas autônoma, dele não fazendo parte. Embora se destine a facilitar a sua aplicação, tem caráter universal, aplicando-se a todos os ramos do direito. Acompanha o Código Civil simplesmente porque se trata do diploma considerado de maior importância. Na realidade constitui um repositório de normas preliminar à totalidade do ordenamento jurídico nacional. A Lei de Introdução às Normas do Direito Brasileiro é um conjunto de normas sobre normas, visto que disciplina as próprias normas jurídicas, determinando o seu modo de aplicação e entendimento, no tempo e no espaço. Ultrapassa ela o âmbito do direito civil, pois enquanto o objeto das leis em geral é o comportamento humano, o da Lei de Introdução às Normas do Direito Brasileiro é a própria norma, visto que disciplina a sua elaboração e vigência, a sua aplicação no tempo e no espaço, as suas fontes etc. Contém normas de sobredireito ou de apoio, podendo ser considerada um Código de Normas, por ter a lei como tema central1. Dirige-se a todos os ramos do direito, salvo naquilo que for regulado de forma diferente na legislação específica. Assim, o dispositivo que manda aplicar a analogia, os costumes e os princípios gerais do direito aos casos omissos (art. 4º) aplica-se a todo o ordenamento jurídico, exceto ao direito penal e ao direito tributário, que contêm normas específicas a esse respeito. O direito penal admite a analogia somente in bonam partem. E o Código Tributário Nacional admite a analogia como critério de hermenêutica, com a ressalva de que não poderá resultar na exigência de tributo não previsto em lei (art. 108, § 1º). Quando o art. 3º da Lei de Introdução prescreve que ninguém se escusa de cumprir a lei alegando que não a conhece, está-se referindo à lei em geral. Tal regra aplica-se a todo o ordenamento. O conteúdo desse verdadeiro Código de Normas extravasa o âmbito do direito civil por abranger princípios que regem a aplicação das normas de direito privado e de direito público no tempo e no espaço (arts. 1º a 6º) e por conter normas de direito internacional privado (arts. 7º a 19). A Lei de Introdução às Normas do Direito Brasileiro é, como o próprio nome indica, aplicável a toda ordenação jurídica, pois tem as funções de: a) regular a vigência e a eficácia das normas jurídicas (arts. 1º e 2º), apresentando soluções ao conflito de normas no tempo (art. 6º) e no espaço (arts. 7º a 19); b) fornecer critérios de hermenêutica (art. 5º); c) estabelecer mecanismos de integração de normas, quando houver lacunas (art. 4º); d) garantir não só a eficácia global da ordem jurídica, não admitindo o erro de direito (art. 3º) que a comprometeria, mas também a certeza, a segurança e estabilidade do ordenamento, preservando as situações consolidadas em que o interesse individual prevalece (art. 6º)2.2 A mencionada Lei n. 12.376, de 30 de dezembro de 2010, com o objetivo de ampliar o campo de aplicação da Lei de Introdução ao Código Civil, como proclama o seu art. 1º, preceitua no art. 2º que “A ementa do Decreto-Lei n. 4.657, de 4 de setembro de 1942, passa a vigorar com a seguinte redação: ‘Lei de Introdução às Normas do Direito Brasileiro’”. O que se observa é que houve apenas mudança do nome da Lei de Introdução, permanecendo, todavia, inalterado o seu conteúdo. 2. Fontes do direito A expressão “fontes do direito” tem várias acepções. Tanto significa o poder de criar normas jurídicas quanto a forma de expressão dessas normas. No último caso, dizem-se de cognição, constituindo-se no modo de expressão das normas jurídicas. Nesse sentido, pode-se dizer que a lei é o objeto da Lei de Introdução às Normas do Direito Brasileiro e a principal fonte do direito. A compreensão da natureza e eficácia das normas jurídicas pressupõe o conhecimento da sua origem ou fonte. Desse modo, não só a autoridade encarregada de aplicar o direito como também aqueles que devem obedecer os seus ditames precisam conhecer as suas fontes, que são de várias espécies. Podemos dizer, de forma sintética, reproduzindo a lição de Caio Mário da Silva Pereira, que fonte de direito “é o meio técnico de realização do direito objetivo”3. Fontes históricas são aquelas das quais se socorrem os estudiosos, quando querem investigar a origem histórica de um instituto jurídico ou de um sistema, como a Lei das XII Tábuas, o Digesto, as Institutas, o Corpus Juris Civilis, as Ordenações do Reino etc. Atuais são as fontes às quais se reporta o indivíduo para afirmar o seu direito, e o juiz, para fundamentar a sentença. Encontra-se no costume a primeira fonte do direito, consubstanciada na observância reiterada de certas regras, consolidadas pelo tempo e revestidas de autoridade. Trata-se do direito não escrito, conservado nos sistemas de Common Law. Com o passar do tempo e a evolução social, bem como a organização do Estado, o direito passa a emanar da autoridade, sob a forma de uma lei imposta coativamente. Surge o direito escrito, em contraposição ao anteriormente mencionado, adotado em quase todos os países do Ocidente. São consideradas fontes formais do direito a lei, a analogia, o costume e os princípios gerais de direito (arts. 4º da LINDB e 126 do CPC); e não formais a doutrina e a jurisprudência. Malgrado a jurisprudência, para alguns, não possa ser considerada, cientificamente, fonte formal de direito, mas somente fonte meramente intelectual ou informativa (não formal), a realidade é que, no plano da realidade prática, ela tem-se revelado fonte criadora do direito. Basta observar a invocação da súmula oficial de jurisprudência nos tribunais superiores (STF e STJ, principalmente) como verdadeira fonte formal, embora cientificamente lhe falte essa condição4. Essa situação se acentuou com a entrada em vigor, em 19 de março de 2007, da Lei n. 11.417, de 19 de dezembro de 2006, que regulamentou o art. 103-A da Constituição Federal e alterou a Lei n. 9.784, de 29 de janeiro de 1999, disciplinando a edição, a revisão e o cancelamento de enunciado de súmula vinculante pelo Supremo Tribunal Federal. Dentre as fontes formais, a lei é a fonte principal, e as demais são fontes acessórias. Costuma-se, também, dividir as fontes do direito em diretas (ou imediatas) e indiretas (ou mediatas). As primeiras são a lei e o costume, que por si só geram a regra jurídica; as segundas são a doutrina e a jurisprudência, que contribuem para que a norma seja elaborada. 3. A lei A exigência de maior certeza e segurança para as relações jurídicas vem provocando, hodiernamente, a supremacia da lei, da norma escrita emanada do legislador, sobre as demais fontes, sendo mesmo considerada a fonte primacial do direito. Malgrado nos países anglo-saxões, como a Inglaterra, por exemplo, predomine o direito consuetudinário, baseado nos usos e costumes e na atividade jurisdicional, tem-se observado, mesmo entre eles, uma crescente influência do processo legislativo. A legislação é o processo de criação das normas jurídicas escritas, de observância geral, e, portanto, a fonte jurídica por excelência. Fonte formal, dessarte, é a atividade legiferante, o meio pelo qual a norma jurídica se positiva com legítima força obrigatória. A lei, em sentido estrito, não seria propriamente fonte de direito, mas sim o produto da legislação, pois, “assim como a fonte de um rio não é a água que brota do manancial, mas é o próprio manancial, a lei não representa a origem, porém o resultado da atividade legislativa”5. Sob essa ótica, a lei, a sentença, o costume e o contrato constituem formas de expressão jurídica resultantes do processo legislativo, da atividade jurisdicional, da prática consuetudinária e do poder negocial6. 3.1. Conceito A palavra “lei” é empregada, algumas vezes, em sentido amplo, como sinônimo de norma jurídica, compreensiva de toda regra geral de conduta, abrangendo normas escritas ou costumeiras, ou ainda como toda norma escrita, abrangendo todos os atos de autoridade, como as leis propriamente ditas, os decretos, os regulamentos etc. Todavia, em sentido estrito indica tão somente a norma jurídica elaborada pelo Poder Legislativo, por meio de processo adequado7. A rigor, portanto, a fonte jurídica formal “é o processo legislativo, que compreende a elaboração de leis, ou melhor, de todas as categorias normativas referidas no art. 59 da nova Carta. Como o direito regula sua própria criação ou elaboração, o processo legislativo está previsto na Constituição Federal”8. A lei, ipso facto, é “um ato do poder legislativo que estabelece normas de comportamento social. Para entrar em vigor, deve ser promulgada e publicada no Diário Oficial. É, portanto, um conjunto ordenado de regras que se apresenta como um texto escrito”9. 3.2. Principais características Dentre as várias características da lei destacam-se as seguintes: a) Generalidade: dirige-se a todos os cidadãos, indistintamente. O seu comando é abstrato, não podendo ser endereçada a determinada pessoa. Essa é uma característica marcante da lei, pois perde ela essa conotação quando particulariza o destinatário, não podendo ser assim denominada, malgrado tenha emanado do poder competente. Todavia, não deixará de ser lei aquela que, embora não se dirija a todos os membros da coletividade, compreende contudo uma determinada categoria de indivíduos. O Estatuto dos Funcionários Públicos, por exemplo, disciplina a situação jurídica de certa categoria de pessoas sem deixar de ser lei e sem perder o caráter de generalidade, porque não personaliza o destinatário, mas rege a atividade e define os direitos e os deveres de um tipo genérico de pessoas, aplicando-se a quantos se encontrem naquela situação, como aos que de futuro venham a adquiri-la10. b) Imperatividade: impõe um dever, uma conduta aos indivíduos. Não é próprio dela aconselhar ou ensinar, nem é de boa técnica formular o legislador definições, que são obra de doutrina. A lei é uma ordem, um comando. Quando exige uma ação, impõe; quando quer uma abstenção, proíbe11. Essa característica inclui a lei entre as normas que regulam o comportamento humano, como a norma moral, a religiosa etc. Todas são normas éticas, providas de sanção. A imperatividade (imposição de um dever de conduta, obrigatório) distingue a norma das leis físicas. Mas não é suficiente para distingui-la das demais leis éticas. c) Autorizamento: é o fato de ser autorizante, segundo Goffredo da Silva Telles, que distingue a lei das demais normas éticas. A norma jurídica, diz ele, autoriza que o lesado pela violação exija o cumprimento dela ou a reparação pelo mal causado. É ela, portanto, que autoriza e legitima o uso da faculdade de coagir12. Não é a sanção, como pretendem alguns, malgrado se trate de característica relevante para a efetivação da lei, que faz essa distinção, pois tanto as normas jurídicas como as normas éticas são sancionadoras. A violação destas pode causar sanção interna (vergonha, remorso) e externa (desconsideração social). Não é também a coação, pois a norma jurídica existe sem ela, tendo plena vigência com sua promulgação, ao passo que a coação depende da preexistência da norma de direito, porque decorre da sua violação. Não é nem mesmo a atributividade, consistente na faculdade de exigir do violador o cumprimento dela ou a reparação do mal sofrido, a característica específica da lei, como querem outros, embora essa concepção se aproxime bastante da sustentada por Goffredo da Silva Telles, já mencionada. Afirma este que a essência específica da norma de direito é o autorizamento, porque o que compete à norma é autorizar ou não o uso dessa faculdade de reação do lesado. A norma jurídica autoriza que o lesado pela violação exija o cumprimento dela ou a reparação pelo mal causado. Esse entendimento é perfilhado por Maria Helena Diniz, que por esse motivo assim conceitua a norma jurídica: imperativo autorizante13. d) Permanência: a lei não se exaure numa só aplicação, pois deve perdurar até ser revogada por outra lei. Algumas normas, entretanto, são temporárias, destinadas a viger apenas durante certo período, como as que constam das disposições transitórias e as leis orçamentárias. e) Emanação de autoridade competente, de acordo com as competências legislativas previstas na Constituição Federal. A lei é ato do Estado, pelo seu Poder Legislativo. O legislador está encarregado de ditar as leis, mas tem de observar os limites de sua competência. Quando exorbita de suas atribuições, o ato é nulo, competindo ao Poder Judiciário recusar-lhe aplicação (CF, art. 97)14. 3.3. Classificação A classificação das leis lato sensu pode ser feita de acordo com vários critérios. Quanto à imperatividade, dividem-se em: a) Cogentes, também denominadas de ordem pública ou de imperatividade absoluta. São mandamentais (ordenam ou determinam uma ação) ou proibitivas (impõem uma abstenção). O art. 1.619 do Código Civil prescreve, por exemplo, que “o adotante há de ser 16 (dezesseis) anos mais velho que o adotado”. E o art. 1.521 elenca as pessoas que “não podem casar”. As normas cogentes se impõem de modo absoluto, não podendo ser derrogadas pela vontade dos interessados. Regulam matéria de ordem pública e de bons costumes, entendendo-se como ordem pública o conjunto de normas que regulam os interesses fundamentais do Estado ou que estabelecem, no direito privado, as bases jurídicas da ordem econômica ou social. A imperatividade absoluta de certas normas decorre da convicção de que determinadas relações ou estados da vida social não podem ser deixados ao arbítrio individual, o que acarretaria graves prejuízos para a sociedade15. As normas que compõem o direito de família, o das sucessões e os direitos reais revestem-se dessa característica. Não pode a vontade dos interessados alterar, por exemplo, os requisitos para a adoção (CC, arts. 1.618 e s.) ou para a habilitação ao casamento (art. 1.525), nem dispensar um dos cônjuges dos deveres que o Código Civil impõe a ambos no art. 1.566. O parágrafo único do art. 2.035 do novo Código Civil, que se encontra no livro complementar das Disposições Finais e Transitórias, dispõe que “nenhuma convenção prevalecerá se contrariar preceitos de ordem pública, tais como os estabelecidos por este Código para assegurar a função social da propriedade e dos contratos”. b) Não cogentes, também chamadas de dispositivas ou de imperatividade relativa. Não determinam nem proíbem de modo absoluto determinada conduta, mas permitem uma ação ou abstenção, ou suprem declaração de vontade não manifestada. Distinguem-se em permissivas, quando permitem que os interessados disponham como lhes convier, como a que permite às partes estipular, antes de celebrado o casamento, quanto aos bens, o que lhes aprouver (CC, art. 1.639), e supletivas, quando se aplicam na falta de manifestação de vontade das partes. No último caso, costumam vir acompanhadas de expressões como “salvo estipulação em contrário” ou “salvo se as partes convencionarem diversamente”. As normas supletivas aplicam-se principalmente no campo do direito das obrigações, na ausência de manifestação de vontade dos interessados. Dispõe, por exemplo, o art. 327 do Código Civil que “efetuar-se-á o pagamento no domicílio do devedor, salvo se as partes convencionarem diversamente...”. Toda lei é dotada de sanção. Esta, no entanto, varia de intensidade conforme os efeitos da transgressão do preceito na prática do ato ou negócio jurídico. Sob esse prisma, ou quanto à intensidade da sanção ou autorizamento, as leis classificam-se em: a) Mais que perfeitas — são as que estabelecem ou autorizam a aplicação de duas sanções, na hipótese de serem violadas. O art. 19 da Lei de Alimentos (Lei n. 5.478, de 25-7-1968) e seu § 1º preveem, por exemplo, a pena de prisão para o devedor de pensão alimentícia e ainda a obrigação de pagar as prestações vencidas e vincendas, sendo que o cumprimento integral da pena corporal não o eximirá da referida obrigação. Em alguns casos, uma das sanções é de natureza penal, como a prevista para o crime de bigamia (CP, art. 235), aplicada cumulativamente com a declaração, no cível, de nulidade do casamento (CC, arts. 1.521, VI, e 1.548, II). b) Perfeitas — são aquelas que impõem a nulidade do ato, simplesmente, sem cogitar de aplicação de pena ao violador, como a que considera nulo o negócio jurídico celebrado por pessoa absolutamente incapaz (CC, art. 166, I), ou a que declara nula a nomeação de tutor pelo pai ou pela mãe que, ao tempo de sua morte, não tinha o poder familiar (art. 1.730). c) Menos que perfeitas — são as que não acarretam a nulidade ou anulação do ato ou negócio jurídico, na circunstância de serem violadas, somente impondo ao violador uma sanção. Mencione-se, a título de exemplo, a situação do viúvo ou viúva, com filho do cônjuge falecido, que se casa antes de fazer inventário e dar partilha dos bens aos herdeiros do cônjuge (CC, art. 1.523, I). Não se anulará por isso o casamento. No entanto, como sanção pela omissão, o casamento será contraído, obrigatoriamente, no regime da separação de bens (CC, art. 1.641, I). d) Imperfeitas — são as leis cuja violação não acarreta nenhuma consequência. É o que sucede com as obrigações decorrentes de dívidas de jogo e de dívidas prescritas, que não obrigam a pagamento (CC, art. 814). O ordenamento não autoriza o credor a efetuar a sua cobrança em juízo. São consideradas normas sui generis, não propriamente jurídicas, “pois estas são autorizantes”16. O legislador procura, todavia, evitar que sejam violadas. A norma que manda pagar a dívida de jogo, por exemplo, embora não tenha a natureza de norma jurídica, adquire eficácia jurídica quando cumprida. O pagamento dessa dívida é inexigível, mas quem a pagar voluntariamente não poderá requerer a restituição do que pagou (CC, art. 882). Segundo a sua natureza, as leis são: a) Substantivas — as que definem direitos e deveres e estabelecem os seus requisitos e forma de exercício. São também chamadas de materiais, porque tratam do direito material. O seu conjunto é denominado direito substantivo, em contraposição às leis processuais, que compõem o direito adjetivo. b) Adjetivas — são as que traçam os meios de realização dos direitos, sendo também denominadas processuais ou formais. Integram o direito adjetivo. Essa classificação, embora tradicional, não é muito utilizada atualmente, sendo mesmo considerada imprópria, porque nem toda lei formal é adjetiva, mas, ao contrário, há leis processuais que são de natureza substantiva, assim como há normas que ao mesmo tempo definem os direitos e disciplinam a forma de sua realização. Quando determinado dispositivo do estatuto processual define um direito, constitui ele norma substantiva, da mesma forma que o preceito de uma lei material. Assim, por exemplo, a norma definidora do direito de ação e o preceito fixador da autoridade da sentença, embora previstos no Código de Processo Civil (arts. 3º e 467), são disposições substantivas. Quanto à sua hierarquia, as normas classificam-se em: a) Normas constitucionais — são as que constam da Constituição, às quais as demais devem amoldar-se. São as mais importantes, por assegurarem os direitos fundamentais do homem, como indivíduo e como cidadão, e disciplinarem a estrutura da nação e a organização do Estado. A Constituição Federal situa-se, com efeito, no topo da escala hierárquica das leis, por traçar as normas fundamentais do Estado. b) Leis complementares — são as que se situam entre a norma constitucional e a lei ordinária, porque tratam de matérias especiais, que não podem ser deliberadas em leis ordinárias e cuja aprovação exige quorum especial (CF, arts. 59, parágrafo único, e 69). Destinam-se à regulamentação de textos constitucionais, quando o direito definido não é auto executável e há necessidade de se estabelecerem os requisitos e forma de sua aquisição e exercício. Sobrepõem-se às ordinárias, que não podem contrariá-las. c) Leis ordinárias — são as que emanam dos órgãos investidos de função legislativa pela Constituição Federal, mediante discussão e aprovação de projetos de lei submetidos às duas Casas do Congresso e, posteriormente, à sanção e promulgação do Presidente da República e publicação no Diário Oficial da União. d) Leis delegadas — são elaboradas pelo Executivo, por autorização expressa do Legislativo, tendo a mesma posição hierárquica das ordinárias (CF, art. 68, §§ 1º a 3º). e) Medidas provisórias — estão situadas no mesmo plano das ordinárias e das delegadas, malgrado não sejam propriamente leis. São editadas pelo Poder Executivo (CF, art. 84, XXVI), que exerce função normativa, nos casos previstos na Constituição Federal. Com o advento da Constituição de 1988, as medidas provisórias substituíram os antigos decretos-leis (art. 25, I, II, §§ 1º e 2º, do ADCT). O art. 62 e §§ 1º a 12 do referido diploma, com a redação da Emenda Constitucional n. 32/2001, permitem que o Presidente da República adote tais medidas, com força de lei, em caso de relevância e urgência, devendo submetê-las de imediato ao Congresso Nacional. Tais medidas provisórias perderão eficácia, desde a edição, se não forem convertidas em lei dentro de sessenta dias, prorrogável por uma única vez por igual prazo, devendo o Congresso Nacional disciplinar, por decreto legislativo, as relações jurídicas delas decorrentes17. A Constituição Federal, tendo em conta a organização federativa, distribui, segundo as matérias, a competência legislativa entre as pessoas jurídicas de direito público interno: a União, os Estados e os Municípios. Desse modo, dividem-se as leis, quanto à competência ou extensão territorial em: a) Leis federais — são as da competência da União Federal, votadas pelo Congresso Nacional, com incidência sobre todo o território nacional, ou parte dele quando se destina, por exemplo, especificamente, à proteção especial de determinada região, como a Amazônica e a atingida sistematicamente pelo fenômeno da seca. A competência legislativa da União é privativa no tocante às matérias elencadas no art. 22 da Constituição Federal, valendo destacar o inciso I, que menciona as concernentes ao “direito civil, comercial, penal, processual, eleitoral, agrário, marítimo, aeronáutico, espacial e do trabalho”. b) Leis estaduais — são as aprovadas pelas Assembleias Legislativas, com aplicação restrita à circunscrição territorial do Estado-membro a que pertencem, ou a determinada parte dele (Vale do Ribeira, por exemplo, em São Paulo, ou Região do Rio São Francisco, nos Estados do Nordeste). Em geral, cada Estado edita leis sobre o que, explícita ou implicitamente, não lhe é vedado pela Constituição Federal (CF, art. 25, § 1º), criando os impostos de sua competência e provendo às necessidades de seu governo e de sua administração18. c) Leis municipais — são as editadas pelas Câmaras Municipais, com aplicação circunscrita aos limites territoriais dos respectivos municípios. Segundo dispõe o art. 30, I a III, da Constituição Federal, compete aos Municípios “legislar sobre assuntos de interesse local, suplementar a legislação federal e a estadual no que couber, instituir e arrecadar os tributos de sua competência...” Finalmente, quanto ao alcance, as leis denominam-se: a) Gerais — quando se aplicam a todo um sistema de relações jurídicas, como as do Código Civil, por exemplo, também chamado de direito comum. b) Especiais — quando se afastam das regras de direito comum e se destinam a situações jurídicas específicas ou a determinadas relações, como as de consumo, as de locação, as concernentes aos registros públicos etc. 4. Vigência da lei As leis também têm um ciclo vital: nascem, aplicam-se e permanecem em vigor até serem revogadas. Esses momentos correspondem à determinação do início de sua vigência, à continuidade de sua vigência e à cessação de sua vigência19. 4.1. Início da vigência O processo de criação da lei passa por três fases: a da elaboração, a da promulgação e a da publicação. Embora nasça com a promulgação, só começa a vigorar com sua publicação no Diário Oficial. Com a publicação, tem-se o início da vigência, tornando-se obrigatória, pois ninguém pode escusar-se de cumpri-la alegando que não a conhece (LINDB, art. 3º). Terminado o processo de sua produção, a norma já é válida. A vigência se inicia com a publicação e se estende até sua revogação, ou até o prazo estabelecido para sua validade. A vigência, portanto, é uma qualidade temporal da norma: o prazo com que se delimita o seu período de validade. Em sentido estrito, vigência designa a existência específica da norma em determinada época, podendo ser invocada para produzir, concretamente, efeitos, ou seja, para que tenha eficácia20. Segundo dispõe o art. 1º da Lei de Introdução às Normas do Direito Brasileiro, a lei, salvo disposição contrária, “começa a vigorar em todo o País 45 (quarenta e cinco) dias depois de oficialmente publicada”. Portanto, a obrigatoriedade da lei não se inicia no dia da publicação, salvo se ela própria assim o determinar. Pode, desse modo, entrar em vigor na data de sua publicação ou em outra mais remota, conforme constar expressamente de seu texto. Se nada dispuser a esse respeito, aplica-se a regra do art. 1º supramencionado. O intervalo entre a data de sua publicação e a sua entrada em vigor denomina-se vacatio legis. Em matéria de duração do referido intervalo, foi adotado o critério do prazo único, porque a lei entra em vigor na mesma data, em todo o País, sendo simultânea a sua obrigatoriedade. A anterior Lei de Introdução, em virtude da enorme vastidão do território brasileiro e das dificuldades de comunicação então existentes, prescrevia que a lei entrava em vigor em prazos diversos, ou seja, menores no Distrito Federal e Estados próximos, e maiores nos Estados mais distantes da Capital e nos territórios21. Seguia, assim, o critério do prazo progressivo. Malgrado a doutrina tome vigor por vigência e vice-versa, o art. 2º da Lei de Introdução às Normas do Direito Brasileiro dispõe: “Art. 2º Não se destinando à vigência temporária, a lei terá vigor até que outra a modifique ou revogue”. Observa Tércio Sampaio Ferraz que “o texto relaciona claramente vigência ao aspecto temporal da norma, a qual, no período (de vigência) tem vigor. Ora, o vigor de uma norma tem a ver com sua imperatividade, com sua força vinculante. Tanto que, embora a citada regra da Lei de Introdução determine o vigor da norma até sua revogação, existem importantes efeitos de uma norma revogada (e que, portanto, perdeu a vigência ou tempo de validade) que nos autorizam dizer que vigor e vigência designam qualidades distintas”22. É certo, pois, que o termo vigência está relacionado ao tempo de duração da lei, ao passo que vigor está relacionado à sua força vinculante. É o caso, como assinala Fábio de Oliveira Azevedo, do Código Civil de 1916, “que não tem mais vigência, por estar revogado, embora ainda possua vigor. Se um contrato foi celebrado durante a sua vigência e tiver que ser examinado hoje, quanto à sua validade, deverá ser aplicado o Código revogado (art. 2.035 do CC/02, na sua primeira parte). Isso significa aplicar uma lei sem vigência (revogada), mas ainda com vigor (determinado pelo art. 2.035)”23. Registre-se que o vigor e a vigência não se confundem com a eficácia da lei. Esta é uma qualidade da norma que se refere à sua adequação em vista da produção concreta de efeitos24. Quando a lei brasileira é admitida no exterior (em geral quando cuida de atribuições de ministros, embaixadores, cônsules, convenções de direito internacional etc.), a sua obrigatoriedade inicia-se três meses depois de oficialmente publicada. Se durante a vacatio legis ocorrer nova publicação de seu texto, para correção de erros materiais ou falha de ortografia, o prazo da obrigatoriedade começará a correr da nova publicação (LINDB art. 1º, § 3º). O novo prazo para entrada em vigor da lei só corre para a parte corrigida ou emendada, ou seja, apenas os artigos republicados terão prazo de vigência contado da nova publicação, para que o texto correto seja conhecido, sem necessidade de que se vote nova lei. Os direitos e obrigações baseados no texto legal publicado hão de ser respeitados25. Se a lei já entrou em vigor, tais correções são consideradas lei nova, tornando-se obrigatória após o decurso da vacatio legis (LINDB, art. 1º, § 4º). Mas, pelo fato de a lei emendada, mesmo com incorreções, ter adquirido força obrigatória, os direitos adquiridos na sua vigência têm de ser resguardados, e não são atingidos pela publicação do texto corrigido26. Admite-se que o juiz, ao aplicar a lei, possa corrigir os erros materiais evidentes, especialmente os de ortografia, mas não os erros substanciais, que podem alterar o sentido do dispositivo legal, sendo imprescindível neste caso nova publicação. A contagem do prazo para entrada em vigor das leis que estabeleçam período de vacância “far-se-á com a inclusão da data da publicação e do último dia do prazo, entrando em vigor no dia subsequente à sua consumação integral” (art. 8º, § 1º, da LC n. 95/98, com redação da LC n. 107/2001). Nessa conformidade, se a lei foi publicada no dia 10 de janeiro de 2002, como ocorreu com o Código Civil de 2002, o primeiro dia do prazo foi 10 de janeiro e o último, sendo o prazo de um ano, 10 de janeiro do ano seguinte. E, assim, o novo Código entrou em vigor no dia 11 de janeiro de 200327. Quando a lei é parcialmente vetada, a parte não vetada é publicada em determinada data. A atingida pelo veto, porém, só é publicada posteriormente, depois de rejeitada a recusa à sanção. Malgrado respeitáveis opiniões em contrário, que pretendem dar caráter retroativo à parte vetada da lei, invocando o argumento da unidade do texto legislativo, os dispositivos vetados só devem entrar em vigor no momento da sua publicação, pois o veto tem caráter suspensivo e os artigos não publicados não se tornaram conhecidos. Essa solução tem a vantagem de proporcionar maior segurança às relações jurídicas28. O prazo de quarenta e cinco dias não se aplica aos decretos e regulamentos, cuja obrigatoriedade determina-se pela publicação oficial. Tornam-se, assim, obrigatórios desde a data de sua publicação29, salvo se dispuserem em contrário, não alterando a data da vigência da lei a que se referem. A falta de norma regulamentadora é hoje suprida pelo mandado de injunção. 4.2. Revogação da lei Cessa a vigência da lei com a sua revogação. Não se destinando à vigência temporária, diz o art. 2º da Lei de Introdução às Normas do Direito Brasileiro, “a lei terá vigor até que outra a modifique ou revogue”. A lei tem, com efeito, em regra, caráter permanente: mantém-se em vigor até ser revogada por outra lei. Nisso consiste o princípio da continuidade. Em um regime que se assenta na supremacia da lei escrita, como o do direito brasileiro, o costume não tem força para revogar a lei, nem esta perde a sua eficácia pelo não uso. Em alguns casos especiais, todavia, a lei pode ter vigência temporária e cessará, então, por causas intrínsecas, tais como: a) Advento do termo fixado para sua duração. Algumas leis, por sua natureza, são destinadas a viger apenas durante certo período, como as disposições transitórias e as leis orçamentárias. Outras, prefixam expressamente a sua duração. b) Implemento de condição resolutiva. A lei perde sua vigência em virtude de condição quando se trata de lei especial vinculada a uma situação determinada, como ao período de guerra, por exemplo, estando sujeita a uma condição resolutiva, qual seja, o término desta. Leis dessa espécie são chamadas de circunstanciais. c) Consecução de seus fins. Cessa a vigência da lei destinada a um determinado fim quando este se realiza. Assim, por exemplo, a que concedeu indenização a familiares de pessoas envolvidas na Revolução de 1964 perdeu a sua eficácia no momento em que as indenizações foram pagas30. Dá-se, nesses casos, a caducidade da lei: torna-se sem efeito pela superveniência de uma causa prevista em seu próprio texto, sem necessidade de norma revogadora. É também o caso de leis cujos pressupostos fáticos desaparecem. Por exemplo, a lei que se destina ao combate de determinada doença (malária, dengue, Aids etc.), estabelecendo normas de proteção, e que deixe de existir em virtude do avanço da Medicina ou de medidas sanitárias. A norma em desuso não perde, só por esse motivo, enquanto não for revogada por outra, a eficácia jurídica. É necessário frisar, como lucidamente o faz Caio Mário da Silva Pereira, que não podem ser invocados como causa geradora da extinção da força obrigatória da lei os motivos psicológicos, econômicos ou sociais que a inspiraram, a não ser que o nascimento da norma decorra especificamente de uma circunstância de fato, cuja cessação definitivamente se verificou31. Por outro lado, as leis de vigência permanente, sem prazo de duração, perduram até que ocorra a sua revogação, não podendo ser extintas pelo costume, jurisprudência, regulamento, decreto, portaria e simples avisos. Revogação é a supressão da força obrigatória da lei, retirando-lhe a eficácia — o que só pode ser feito por outra lei, da mesma hierarquia ou de hierarquia superior. O ato de revogar consiste, segundo Maria Helena Diniz, em “tornar sem efeito uma norma, retirando sua obrigatoriedade. Revogação é um termo genérico, que indica a ideia da cessação da existência da norma obrigatória”32. A revogação da lei (gênero), quanto à sua extensão, pode ser de duas espécies: total ou parcial. A revogação total é também denominada ab-rogação. Consiste na supressão integral da norma anterior. O novo Código Civil, por exemplo, no art. 2.045, inserido no livro complementar das Disposições Finais e Transitórias, revoga, sem qualquer ressalva, e portanto integralmente, o estatuto civil de 1916. A revogação parcial denomina-se derrogação. Atinge só uma parte da norma, que permanece em vigor no restante. O Código de Processo Civil, por exemplo, tem sofrido constantes reformas parciais, sendo as mais recentes determinadas pelas Leis n. 11.232/2005, 11.382/2006, 11.410/2006 e 11.441/2007, que alteraram dispositivos referentes a execução, separação judicial, divórcio, inventários e informatização do processo judicial etc. A lei perde, todavia, a eficácia (caduca), independentemente de outra lei, se em seu texto constar o próprio termo, como já foi dito. A perda da eficácia pode decorrer, também, da decretação de sua inconstitucionalidade pelo Supremo Tribunal Federal, cabendo ao Senado suspender-lhe a execução (CF, art. 52, X). Uma lei revoga-se por outra lei. Desse modo, a revogação deve emanar da mesma fonte que aprovou o ato revogado. Se, por exemplo, a norma é de natureza constitucional, somente pelo processo de emenda à Constituição pode ser modificada ou revogada (CF, art. 60). Por outro lado, um decreto revoga-se por outro decreto, mas também pode ser revogado pela lei, que é de hierarquia superior. A nova lei que revoga a anterior revoga também o decreto que a regulamentou. O princípio da hierarquia não tolera que uma lei ordinária sobreviva a uma disposição constitucional, que a contrarie, ou uma norma regulamentar subsista em ofensa à disposição legislativa. Assim, a Constituição que modifica o regime político torna ineficazes todas as disposições anteriores incompatíveis com a nova ordem política. A Constituição de 1946, por exemplo, invalidou todas as disposições contidas nas leis, decretos-leis ou decretos que, datando do Estado Novo, contrariavam os princípios básicos do regime democrático. E a Carta de 1988 afastou a validade da legislação anterior conflitante com as suas disposições autoexecutáveis. Não se trata propriamente de revogação das leis anteriores e contrárias à Constituição: apenas deixaram de existir no plano do ordenamento jurídico estatal, por haverem perdido seu fundamento de validade33. As normas constitucionais programáticas, ou dependentes da elaboração de leis complementares ou ordinárias, ao contrário, não revogam as normas anteriores, que continuam vigentes até a aprovação dos novos textos legislativos que concretizem as determinações constitucionais34. No tocante à lei cuja obrigatoriedade está subordinada à publicação de regulamento e decreto destinado à sua execução, tem-se entendido que o prazo de vigência será contado a partir da publicação do regulamento depois de decorridos os prazos do art. 1º da Lei de Introdução às Normas do Direito Brasileiro. Se apenas uma parte da lei depender de regulamentação, só a ela é aplicável a restrição. Hoje, no entanto, é possível suprir-se a falta de regulamentação subsequente da lei mediante a impetração de mandado de injunção junto ao Poder Judiciário, previsto no art. 5º, LXXI, da Constituição Federal, por todo aquele que se julgue prejudicado pela omissão legislativa e a impossibilidade de exercer os direitos constitucionalmente previstos35. Quanto à forma de sua execução, a revogação da lei pode ser expressa ou tácita. Expressa, quando a lei nova declara, de modo taxativo e inequívoco, que a lei anterior, ou parte dela, fica revogada (LINDB, art. 2º, § 1º, primeira parte). Tácita, quando não contém declaração nesse sentido, mas mostra-se incompatível com a lei antiga ou regula inteiramente a matéria de que tratava a lei anterior (art. 2º, § 1º, última parte). A revogação, neste caso, ocorre por via oblíqua ou indireta. A revogação expressa é a mais segura, pois evita dúvidas e obscuridades. O art. 9º da Lei Complementar n. 95/98, com a redação da Lei Complementar n. 107/2001, por esse motivo dispõe que “a cláusula de revogação deverá enumerar, expressamente, as leis ou disposições legais revogadas”. Tal preceito, todavia, foi ignorado pelo art. 2.045 do novo Código Civil, ao dispor: “Revogam-se a Lei n. 3.071, de 1º de janeiro de 1916 — Código Civil e a Parte Primeira do Código Comercial — Lei n. 556, de 25 de junho de 1850”. O que caracteriza a revogação tácita é a incompatibilidade das disposições novas com as já existentes. Na impossibilidade de coexistirem normas contraditórias, aplica-se o critério da prevalência da mais recente (critério cronológico: lex posterior derogat legi priori). Essa incompatibilidade pode ocorrer quando a lei nova, de caráter amplo e geral, passa a regular inteiramente a matéria versada na lei anterior, vindo a lei revogadora, neste caso, substituir inteiramente a antiga. Desse modo, se toda uma matéria é submetida a nova regulamentação, desaparece inteiramente a lei anterior que tratava do mesmo assunto. Com a entrada em vigor, por exemplo, do Código de Defesa do Consumidor, deixaram de ser aplicadas às relações de consumo as normas de natureza privada estabelecidas no Código Civil de 1916 e em leis esparsas que tratavam dessa matéria36. Em regra, pois, “um novo estado de coisas revoga automaticamente qualquer regra de direito que com ele seja incompatível. Da mesma forma, a modificação de redação do texto de um dispositivo legal constitui modo usado pelo legislador para revogá-lo, derrogá-lo ou ab-rogá-lo. Por fim, se a lei nova regula a matéria de que trata a lei anterior e não reproduz determinado dispositivo, entende-se que este foi revogado”37. Costuma-se dizer que ocorre, também, a revogação tácita de uma lei quando se mostra incompatível com a mudança havida na Constituição, em face da supremacia desta sobre as demais leis (critério hierárquico: lex superior derogat legi inferiori). Mais adequado, porém, nesse caso, é afirmar que perderam elas seu fundamento de validade, como exposto anteriormente. Além dos critérios cronológico e hierárquico já mencionados, destinados a solucionar antinomias aparentes ou conflitos normativos, desponta na ordem jurídica o da especialidade (lex specialis derogat legi generali), pelo qual a norma especial revoga a geral quando disciplinar, de forma diversa, o mesmo assunto. Todavia, o art. 2º, § 2º, da Lei de Introdução às Normas do Direito Brasileiro prescreve: “A lei nova, que estabeleça disposições gerais ou especiais a par das já existentes, não revoga nem modifica a lei anterior”. Podem, assim, coexistir as normas de caráter geral e as de caráter especial. É possível, no entanto, que haja incompatibilidade entre ambas. A existência de incompatibilidade conduz à possível revogação da lei geral pela especial, ou da lei especial pela geral. Para Giuseppe Saredo, disposição especial revoga a geral quando se referir ao mesmo assunto, alterando-a. Não a revoga, contudo, quando, em vez de alterá-la, se destina a lhe dar força38. Pondera, a propósito, Caio Mário da Silva Pereira que a coexistência das duas espécies de normas “não é afetada, quando o legislador vote disposições gerais a par de especiais, ou disposições especiais a par de gerais já existentes, porque umas e outras não se mostram, via de regra, incompatíveis. Não significa isto, entretanto, que uma lei geral nunca revogue uma lei especial, ou vice-versa, porque nela poderá haver dispositivo incompatível com a regra especial, da mesma forma que uma lei especial pode mostrar-se incompatível com dispositivo inserto em lei geral”. Ao intérprete, acrescenta, “cumpre verificar, entretanto, se uma nova lei geral tem o sentido de abolir disposições preexistentes”39. Não se pode, portanto, acolher de modo absoluto a fórmula “lei especial revoga a geral”, pois nem sempre isso acontece, podendo perfeitamente ocorrer que a especial introduza uma exceção ao princípio geral, que deve coexistir ao lado deste. Havendo incompatibilidade haverá revogação tanto da lei geral pela especial como da lei especial pela geral. Antinomia é a presença de duas normas conflitantes. Decorre da existência de duas ou mais normas relativas ao mesmo caso, imputando-lhe soluções logicamente incompatíveis. Como já mencionado, três critérios devem ser levados em conta para a solução dos conflitos: a) critério cronológico (a norma posterior prevalece sobre a anterior); b) critério da especialidade (a norma especial prevalece sobre a geral); c) critério hierárquico (a norma superior prevalece sobre a inferior). Quando o conflito de normas envolve apenas um dos referidos critérios, diz-se que se trata de antinomia de 1º grau. Será de 2º grau quando envolver dois deles. Na última hipótese, se o conflito se verificar entre uma norma especial-anterior e outra geral-posterior, prevalecerá o critério da especialidade, aplicando-se a primeira norma; e, se ocorrer entre norma superior-anterior e outra inferior-posterior, prevalecerá o hierárquico, aplicando-se também a primeira. A antinomia pode ser, ainda, aparente e real. Antinomia aparente é a situação que pode ser resolvida com base nos critérios supramencionados. Antinomia real é o conflito que não pode ser resolvido mediante a utilização dos aludidos critérios. Ocorre, por exemplo, entre uma norma superior-geral e outra norma inferior-especial. Não sendo possível remover o conflito ante a dificuldade de se apurar qual a norma predominante, a antinomia será solucionada por meio dos mecanismos destinados a suprir as lacunas da lei (LINDB, arts. 4º e 5º). O nosso direito não admite, como regra, a repristinação, que é a restauração da lei revogada pelo fato da lei revogadora ter perdido a sua vigência. Preceitua, com efeito, o § 3º do art. 2º da Lei de Introdução às Normas do Direito Brasileiro que, “salvo disposição em contrário, a lei revogada não se restaura por ter a lei revogadora perdido a vigência”. Não há, portanto, o efeito repristinatório, restaurador, da primeira lei revogada, salvo quando houver pronunciamento expresso do legislador nesse sentido. Assim, por exemplo, revogada a Lei n. 1 pela Lei n. 2, e posteriormente revogada a lei revogadora (n. 2) pela Lei n. 3, não se restabelece a vigência da Lei n. 1, salvo se a n. 3, ao revogar a revogadora (n. 2), determinar a repristinação da n. 1. 5. Obrigatoriedade das leis Sendo a lei uma ordem dirigida à vontade geral, uma vez em vigor torna-se obrigatória para todos. O art. 3º da Lei de Introdução às Normas do Direito Brasileiro consagra o princípio da obrigatoriedade (ignorantia legis neminem excusat), prescrevendo: “Ninguém se escusa de cumprir a lei, alegando que não a conhece”. Tal dispositivo visa garantir a eficácia global da ordem jurídica, que estaria comprometida se se admitisse a alegação de ignorância de lei vigente. Como consequência, não se faz necessário provar em juízo a existência da norma jurídica invocada, pois se parte do pressuposto de que o juiz conhece o direito (iura novit curia). Esse princípio não se aplica ao direito municipal, estadual, estrangeiro ou consuetudinário (CPC, art. 337). Embora o juiz tenha o dever de conhecer o direito vigente em todo o país, não está obrigado a saber quais princípios são adotados no direito alienígena, nem as regras especiais a determinado município ou a um Estado federativo, nem ainda como é o costume. Três teorias procuram justificar o preceito: a da presunção legal, a da ficção legal e a da necessidade social. A primeira presume que a lei, uma vez publicada, torna-se conhecida de todos. É criticada por basear-se em uma inverdade40. A da ficção legal considera tratar-se de hipótese de ficção, e não de presunção — o que também, em verdade, não ocorre41. A teoria da necessidade social, defendida por Clóvis Beviláqua42, é a mais aceita, porque sustenta que a lei é obrigatória e deve ser cumprida por todos, não por motivo de um conhecimento presumido ou ficto, mas por elevadas razões de interesse público, ou seja, para que seja possível a convivência social. O preceito de que ninguém pode escusar-se de cumprir a lei, alegando que não a conhece, seria uma regra ditada por uma razão de ordem social e jurídica, de necessidade social: garantir a eficácia global do ordenamento jurídico, que ficaria comprometido caso tal alegação pudesse ser aceita43. A publicação oficial da lei tem por finalidade torná-la conhecida, mas visa precipuamente neutralizar a ignorância, sem contudo eliminá-la. Neutralizar a ignorância, segundo Tércio Sampaio Ferraz Jr., é “fazer com que ela não seja levada em conta, não obstante possa existir”44. A inaceitabilidade da alegação de ignorância da lei não afasta, todavia, a relevância do erro de direito, que é o conhecimento falso da lei, como causa de anulação de negócios jurídicos. Este só pode ser invocado, porém, quando não houver o objetivo de furtar-se o agente ao cumprimento da lei. Serve para justificar, por exemplo, a boa-fé em caso de inadimplemento contratual, sem a intenção de descumprir a lei. Eduardo Espínola, citando Colin e Capitant, dá o seguinte exemplo de erro de direito: “Paulo, menor de 16 anos, morre, depois de fazer testamento. Eu, que sou seu herdeiro, satisfaço os legados, ignorando que o menor de 16 anos não pode fazer testamento”. Trata-se “de erro de direito capaz de anular tais atos, pois o que se verifica não é a intenção de descumprir a lei, mas a circunstância de que seu desconhecimento é que levou à prática de ato normalmente não realizável”45. O Código Civil de 2002, ao enumerar os casos em que há erro substancial (art. 139), contempla, como inovação, ao lado das hipóteses de erro de fato (error facti), que decorre de uma noção falsa das circunstâncias, o erro de direito (error juris), desde que não se objetive, com a sua alegação, descumprir a lei ou subtrair-se à sua força imperativa e seja o motivo único ou principal do negócio jurídico. A Lei das Contravenções Penais, por exceção, admite a alegação de erro de direito (art. 8º) como justificativa pelo descumprimento da lei. No direito mexicano tal alegação é admitida em várias hipóteses, tendo em vista que a população daquele país é constituída, em grande parte, de indígenas. 6. A integração das normas jurídicas O legislador não consegue prever todas as situações para o presente e para o futuro, pois o direito é dinâmico e está em constante movimento, acompanhando a evolução da vida social, que traz em si novos fatos e conflitos. Ademais, os textos legislativos devem ser concisos e seus conceitos enunciados em termos gerais. Tal estado de coisas provoca a existência de situações não previstas de modo específico pelo legislador e que reclamam solução por parte do juiz. Como este não pode eximir-se de proferir decisão sob o pretexto de que a lei é omissa, deve valer-se dos mecanismos destinados a suprir as lacunas da lei, que são: a analogia, os costumes e os princípios gerais de direito. Dispõe, com efeito, o art. 126 do Código de Processo Civil: “O juiz não se exime de sentenciar ou despachar alegando lacuna ou obscuridade da lei. No julgamento da lide caber-lhe-á aplicar as normas legais; não as havendo, recorrerá à analogia, aos costumes e aos princípios gerais de direito”. Verifica-se, portanto, que o próprio sistema apresenta solução para qualquer caso que esteja sub judice. Apresenta-se, destarte, o problema da integração da norma mediante recursos fornecidos pela ciência jurídica. A própria lei, prevendo a possibilidade de inexistir norma jurídica adequada ao caso concreto, indica ao juiz o meio de suprir a omissão, prescrevendo, igualmente, o art. 4º da Lei de Introdução às Normas do Direito Brasileiro: “Quando a lei for omissa, o juiz decidirá o caso de acordo com a analogia, os costumes e os princípios gerais de direito”. Aponta Francisco Amaral46, com apoio em Wilson de Souza Campos Batalha, Larenz, Carlos Cossio e outros, a existência de duas concepções doutrinárias a respeito das lacunas de direito: a que reconhece existirem lacunas em todos os sistemas jurídicos, pela impossibilidade de se prever a totalidade das situações de fato que a vida oferece, e a que defende a inexistência de tais vazios, em face da plenitude da ordem jurídica. Se existem lacunas na lei, no direito não podem existir, e por isso, para os juristas que contestam a existência de lacunas, o direito, concebido como sistema, dispõe de princípios gerais dos quais sempre se poderá deduzir uma solução. Efetivamente, sob o ponto de vista dinâmico, o da aplicação da lei, pode ela ser lacunosa, mas o sistema não. Isso porque o juiz, utilizando-se dos aludidos mecanismos, promove a integração das normas jurídicas, não deixando nenhum caso sem solução (plenitude lógica do sistema). O direito estaticamente considerado pode conter lacunas. Sob o aspecto dinâmico, entretanto, não, pois ele próprio prevê os meios para suprir-se os espaços vazios e promover a integração do sistema47. Por essa razão é que se diz que os mencionados mecanismos constituem modos de explicitação da integridade, da plenitude do sistema jurídico. 6.1. A analogia Há uma hierarquia na utilização desses mecanismos, figurando a analogia em primeiro lugar. Somente podem ser utilizados os demais se a analogia não puder ser aplicada. Isso porque o direito brasileiro consagra a supremacia da lei escrita. Quando o juiz utiliza-se da analogia para solucionar determinado caso concreto, não está apartando-se da lei, mas aplicando à hipótese não prevista em lei um dispositivo legal relativo a caso semelhante. Nisso se resume o emprego da analogia, que consiste em aplicar a caso não previsto a norma legal concernente a uma hipótese análoga prevista e, por isso mesmo, tipificada48. O seu fundamento encontra-se no adágio romano ubi eadem ratio, ibi idem jus (ou legis dispositio), que expressa o princípio de igualdade de tratamento. Com esse enunciado lógico pretende-se dizer que a situações semelhantes deve-se aplicar a mesma regra de direito (“quando se verifica a mesma razão da lei, deve haver a mesma solução ‘ou mesma disposição legal’”). Se um dos fatos já tem no sistema jurídico a sua regra, é essa que se aplica. O Decreto n. 2.682, de 7 de dezembro de 1912, é sempre mencionado como interessante exemplo de aplicação da analogia. Destinado a regulamentar a responsabilidade das companhias de estradas de ferro por danos causados a passageiros e a bagagens, passou a ser aplicado, por analogia, a todas as espécies de transportes terrestres (bonde, metrô, ônibus e até em acidentes ocorridos em elevadores), à falta de legislação específica. Hoje, a atividade de transporte em geral é regida pelo Código de Defesa do Consumidor. Para o emprego da analogia requer-se a presença de três requisitos: a) inexistência de dispositivo legal prevendo e disciplinando a hipótese do caso concreto; b) semelhança entre a relação não contemplada e outra regulada na lei; c) identidade de fundamentos lógicos e jurídicos no ponto comum às duas situações49. Costuma-se distinguir a analogia legis (legal) da analogia juris (jurídica). A primeira consiste na aplicação de uma norma existente, destinada a reger caso semelhante ao previsto. A sua fonte é a norma jurídica isolada, que é aplicada a casos idênticos. A segunda baseia-se em um conjunto de normas, para obter elementos que permitam a sua aplicação ao caso sub judice não previsto, mas similar. Trata-se de um processo mais complexo, em que se busca a solução em uma pluralidade de normas, em um instituto ou em acervo de diplomas legislativos, transpondo o pensamento para o caso controvertido, sob a inspiração do mesmo pressuposto. A analogia juris, dada a amplitude de sua órbita de ação, requer cuidado maior e segurança na sua aplicação, pois nem sempre é fácil caracterizar com exatidão o princípio dominante numa instituição, sob pena de levar o aplicador a divorciar-se da vontade legal. Não se deve confundir a construção jurisprudencial baseada nos textos legais com o direito alternativo, que se afasta da lei para decidir a controvérsia de acordo com o sentimento pessoal de justiça do magistrado50. Faz-se mister não confundir analogia com interpretação extensiva. A primeira implica o recurso a outra norma do sistema jurídico, em razão da inexistência de norma adequada à solução do caso concreto. A segunda, porém, consiste na extensão do âmbito de aplicação da mesma norma a situações não expressamente previstas mas compreendidas pelo seu espírito, mediante uma interpretação menos literal. Configura-se, por exemplo, quando o juiz, interpretando o art. 25 do Código Civil, estende à companheira ou companheiro a legitimidade conferida ao cônjuge do ausente para ser o seu curador. Os negócios jurídicos benéficos e a renúncia não admitem o emprego da analogia, nem interpretação extensiva, pois dispõe o art. 114 do Código Civil que “interpretam-se estritamente”. Também o art. 819 do referido diploma preceitua que a fiança “não admite interpretação extensiva”. Pelo mesmo motivo, ou seja, por importar restrição ou renúncia a direito, a transação “interpreta-se restritivamente” (CC, art. 843). O recurso à analogia não é, com efeito, ilimitado. Não é ela admitida no direito penal, salvo se beneficiar o réu; nas leis excepcionais ou de exceção, devendo, nessa hipótese, os casos não previstos ser disciplinados pelas normas de caráter geral; e nas leis fiscais que impõem tributos (CTN, art. 108, § 1º)51. 6.2. O costume O costume é, também, fonte supletiva em nosso sistema jurídico, porém está colocado em plano secundário, em relação à lei. O juiz só pode recorrer a ele depois de esgotadas as possibilidades de suprir a lacuna pelo emprego da analogia. Daí dizer-se que o costume se caracteriza como fonte subsidiária ou fonte supletiva. Difere da lei quanto à origem, posto que esta nasce de um processo legislativo, tendo origem certa e determinada, enquanto o costume tem origem incerta e imprevista. Distinguem-se, ainda, no tocante à forma, pois a lei apresenta-se sempre como texto escrito, enquanto o costume é direito não escrito, consuetudinário, salvo no caso de sua consolidação ou de recolhimento em repositórios em que possam ser consultadas. Mesmo nesta hipótese, como se deu na França, antes da codificação, com as regiões chamadas “países de direito costumeiro” e as coletâneas intituladas Coûtumes de Paris, conserva a característica de direito não escrito52. O costume é composto de dois elementos: o uso ou prática reiterada de um comportamento (elemento externo ou material) e a convicção de sua obrigatoriedade (elemento interno ou psicológico, caracterizado pela opinio juris et necessitate). Em consequência, é conceituado como sendo a prática uniforme, constante, pública e geral de determinado ato, com a convicção de sua necessidade53. Essa convicção, que é o fundamento da obrigatoriedade do costume, deve ser geral, cultivada por toda a sociedade ou observada por uma parcela ponderável da comunidade, ou ao menos mantida por uma categoria especial de pessoas. Para que se converta, porém, em costume jurídico, e deixe de ser simples uso sem força coercitiva, é necessário que a autoridade judiciária tome conhecimento de sua existência e o aplique, declarando-o obrigatório. Pela tese da confirmação jurisprudencial, que se opõe à da confirmação legislativa (inadmissível, por exigir a confirmação do legislador, exagerando o papel deste), é necessário que o costume se consagre pela prática judiciária54. Em relação à lei, três são as espécies de costume: a) Secundum legem, quando se acha expressamente referido na lei. Neste caso, sua eficácia é reconhecida pelo direito positivo, como nos casos mencionados, dentre outros, nos arts. 1.297, § 1º, 596 e 615 do Código Civil. Passa a ter caráter de verdadeira lei, deixando de ser costume propriamente dito. b) Praeter legem, quando se destina a suprir a lei, nos casos omissos, como prevê o art. 4º da Lei de Introdução às Normas do Direito Brasileiro e o art. 126 do Código de Processo Civil. Costuma-se mencionar, como exemplo, o costume de efetuar-se o pagamento com cheque pré-datado, e não como ordem de pagamento à vista, afastando a existência de crime. Costume praeter legem é, portanto, um dos expedientes a que deve recorrer o juiz para sentenciar quando a lei é omissa. c) Contra legem, que se opõe à lei. Em regra, o costume não pode contrariar a lei, pois esta só se revoga, ou se modifica, por outra lei. Essa a doutrina dominante: o costume contrário à aplicação da lei não tem o poder de revogá-la, não existindo mais a chamada desuetudo (não aplicação da lei em virtude do desuso). Os autores em geral rejeitam o costume contra legem por entendê-lo incompatível com a tarefa do Estado e com o princípio de que as leis só se revogam por outras55. 6.3. Os princípios gerais de direito Não encontrando solução na analogia, nem nos costumes, para preenchimento da lacuna, o juiz deve buscá-la nos princípios gerais de direito. São estes constituídos de regras que se encontram na consciência dos povos e são universalmente aceitas, mesmo não escritas. Tais regras, de caráter genérico, orientam a compreensão do sistema jurídico, em sua aplicação e integração, estejam ou não incluídas no direito positivo. Muitas delas passaram a integrar o nosso direito positivo, como a de que “ninguém pode lesar a outrem” (CC, art. 186), a que veda o enriquecimento sem causa (arts. 1.216, 1.220, 1.255, 876 etc.), a que não admite escusa de não cumprimento da lei por não conhecê-la (LINDB, art. 3º). Em sua maioria, no entanto, os princípios gerais de direito estão implícitos no sistema jurídico civil, como o de que “ninguém pode valer-se da própria torpeza”, o de que “a boa-fé se presume”, o de que “ninguém pode transferir mais direitos do que tem”, o de que “se deve favorecer mais aquele que procura evitar um dano do que aquele que busca realizar um ganho” etc. Quando o objeto do contrato é imoral, os tribunais por vezes aplicam o princípio de direito de que ninguém pode valer-se da própria torpeza (nemo auditur propriam turpitudinem allegans). Tal princípio é aplicado pelo legislador, por exemplo, no art. 150 do Código Civil, que reprime o dolo ou torpeza bilateral. Segundo o ensinamento de Francisco Amaral, os “princípios jurídicos positivos distinguem-se em princípios constitucionais ou superiores, e princípios institucionais, que fundamentam e sistematizam determinados institutos ou instituições jurídicas. No direito brasileiro são princípios constitucionais, superiores, fundamentais, os referidos no art. 1º da Constituição Federal: soberania, cidadania, dignidade da pessoa humana, os valores sociais do trabalho e da livre-iniciativa, o pluralismo político. Têm força normativa, são Constituição, tendo aplicação preferencial sobre qualquer norma ordinária que se lhes oponha ou contradiga. São princípios institucionais, ou legislativos, no direito de família, o princípio da igualdade dos cônjuges (CF, art. 226, § 5º), o princípio da igualdade dos filhos (CF, art. 227, § 6º). (...) Os princípios gerais de direito são diretivas básicas e gerais que orientam o intérprete ao aplicar o direito no caso de omissão do texto legal”56. Os princípios gerais de direito não se confundem com as máximas jurídicas, os adágios ou brocardos, que nada mais são do que fórmulas concisas representativas de uma experiência secular, sem valor jurídico próprio, mas dotados de valor pedagógico. Algumas dessas máximas podem, porém, conter princípios gerais de direito, como por exemplo: “o acessório segue o principal”, “não obra com dolo quem usa de seu direito”, testis unus testis nullus (uma só testemunha não é nenhuma) etc.57 Para que possam ser empregados como norma de direito supletório, os princípios gerais de direito devem ser reconhecidos como direito aplicável, dotados assim de juridicidade. 6.4. A equidade A equidade não constitui meio supletivo de lacuna da lei, sendo mero recurso auxiliar da aplicação desta. Não considerada em sua acepção lata, quando se confunde com o ideal de justiça, mas em sentido estrito, é empregada quando a própria lei cria espaços ou lacunas para o juiz formular a norma mais adequada ao caso. É utilizada quando a lei expressamente o permite. Prescreve o art. 127 do Código de Processo Civil que o “juiz só decidirá por equidade nos casos previstos em lei”. Isso ocorre geralmente nos casos de conceitos vagos ou quando a lei formula várias alternativas e deixa a escolha a critério do juiz. Como exemplos podem ser citados o art. 1.586 do Código Civil, que autoriza o juiz a regular por maneira diferente dos critérios legais a situação dos filhos em relação aos pais, se houver motivos graves e a bem do menor; e o art. 1.740, II, que permite ao tutor reclamar do juiz que providencie, “como houver por bem”, quando o menor tutelado haja mister correção, dentre outros. A equidade está ínsita no art. 5º da Lei de Introdução às Normas do Direito Brasileiro, quando este recomenda ao juiz que atenda, ao aplicar a lei, aos fins sociais a que ela se destina, adequando-a às exigências oriundas das mutações sociais, e às exigências do bem comum. Decidiu o Superior Tribunal de Justiça que “a proibição de que o juiz decida por equidade, salvo quando autorizado por lei, significa que não haverá de substituir a aplicação do direito objetivo por seus critérios pessoais de justiça. Não há de ser entendida, entretanto, como vedando se busque alcançar a justiça no caso concreto, com atenção ao disposto no art. 5º da Lei de Introdução”58. 7. Aplicação e interpretação das normas jurídicas As normas são genéricas e impessoais e contêm um comando abstrato, não se referindo especificamente a casos concretos. A composição dos conflitos, baseada na lei, é na realidade um silogismo, em virtude do qual se aplica a norma geral e prévia a um caso concreto. A premissa maior é a norma jurídica, regulando uma situação abstrata, e a premissa menor é o caso concreto. A conclusão é a sentença judicial que aplica a norma abstrata ao caso concreto59. Quando o fato é típico e se enquadra perfeitamente no conceito abstrato da norma, dá-se o fenômeno da subsunção. Há casos, no entanto, em que tal enquadramento não ocorre, não encontrando o juiz nenhuma norma aplicável à hipótese sub judice. Deve, então, proceder à integração normativa, mediante o emprego da analogia, dos costumes e dos princípios gerais do direito, como já foi dito. Francisco Amaral assevera que o raciocínio jurídico não costuma ser tão simples como no silogismo de subsunção, pois a vida real é muito mais complexa. Assim, aduz, “a tendência atual, embora reconheça a importância da lógica formal no raciocínio jurídico, é para combater ‘a concepção mecânica do silogismo’, aceitando a contribuição da lógica dialética ou lógica da argumentação, que contesta uma aplicação rígida e inflexível das leis, respeitando a dupla exigência do direito, de ordem sistemática, que é a criação de uma ordem coerente e unitária, e de ordem pragmática, que é a busca de soluções ideologicamente aceitáveis e socialmente justas”60. Para verificar se a norma é aplicável ao caso em julgamento (subsunção) ou se deve proceder à integração normativa, o juiz procura descobrir o sentido da norma, interpretando-a. Interpretar é descobrir o sentido e o alcance da norma jurídica. Toda lei está sujeita a interpretação, não apenas as obscuras e ambíguas. O brocardo romano in claris cessat interpretatio não é, hoje, acolhido, pois até para afirmar-se que a lei é clara é preciso interpretá-la. Há, na verdade, interpretações mais simples, quando a lei é clara, e complexas, quando o preceito é de difícil entendimento61. Para os adeptos da interpretação subjetiva, o que se pesquisa com a interpretação é a vontade do legislador (voluntas legislatoris) expressa na lei. Tal concepção, no entanto, não tem sido acolhida, pois quando a norma é antiga a vontade do legislador originário está normalmente superada. Mais aceitas são as teorias da interpretação objetiva e da livre pesquisa do direito. A primeira sustenta que não é a vontade do legislador que se visa, mas a vontade da lei (voluntas legis), ou melhor, o sentido da norma. A lei depois de promulgada separa-se de seu autor e alcança uma existência objetiva. Para a segunda, o juiz deve ter função criadora na aplicação da norma, que deve ser interpretada em função das concepções jurídicas morais e sociais de cada época62. Não significa, entretanto, prestigiar o direito alternativo, que “pode conduzir à plena subversão da ordem constituída”, como obtempera Caio Mário da Silva Pereira, aduzindo que o direito brasileiro, à luz do art. 5º da LICC (atual LINDB), adota a linha do equilíbrio63. A hermenêutica é a ciência da interpretação das leis. Como toda ciência, tem os seus métodos. Quanto às fontes ou origem, os métodos de interpretação classificam-se em: autêntico, jurisprudencial e doutrinário Interpretação autêntica ou legislativa é a feita pelo próprio legislador, por outro ato. Este, reconhecendo a ambiguidade da norma, vota uma nova lei, destinada a esclarecer a sua intenção. Vale observar que se trata de fato não muito comum. Nesse caso, a lei interpretativa é considerada como a própria lei interpretada. Interpretação jurisprudencial ou judicial é a fixada pelos tribunais. Embora não tenha força vinculante, influencia grandemente os julgamentos nas instâncias inferiores. As súmulas vinculantes eram preconizadas como uma forma de reduzir a avalanche de processos que sobrecarrega os tribunais do País e acarreta a demora dos julgamentos. Atendendo a esses reclamos, a Lei n. 11.417, de 19 de dezembro de 2006, que regulamentou o art. 103-A da Constituição Federal e alterou a Lei n. 9.784, de 29 de janeiro de 1999, disciplinou a edição, a revisão e o cancelamento de enunciado de súmula vinculante pelo Supremo Tribunal Federal. Interpretação doutrinária é a feita pelos estudiosos e comentaristas do direito: os jurisconsultos. É um método importante porque, publicada uma lei ou entrado em vigor um Código, os doutrinadores estudam e analisam o seu texto, fornecendo subsídios, à luz dos conceitos inspiradores da norma, para que os operadores do direito, especialmente os advogados, juízes e promotores, possam entender o seu sentido e alcance e melhor aplicá-la em suas atividades. Quanto aos meios, a interpretação pode ser feita pelos métodos gramatical, lógico, sistemático, histórico e sociológico. A interpretação gramatical é também chamada de literal, porque consiste em exame do texto normativo sob o ponto de vista linguístico, analisando a pontuação, a colocação das palavras na frase, a sua origem etimológica etc. É a primeira fase do processo interpretativo. Já decidiu o Superior Tribunal de Justiça que a “interpretação meramente literal deve ceder passo quando colidente com outros métodos de maior robustez e cientificidade”64. Na interpretação lógica ou racional, que atende ao espírito da lei, procura-se apurar o sentido e a finalidade da norma, a intenção do legislador, por meio de raciocínios lógicos, com abandono dos elementos puramente verbais. O intérprete procura extrair as várias interpretações possíveis, eliminando as que possam parecer absurdas e que levem a um resultado contraditório em relação a outros preceitos, para descobrir a razão de ser das leis. A interpretação sistemática parte do pressuposto de que uma lei não existe isoladamente e deve ser interpretada em conjunto com outras pertencentes à mesma província do direito, levando-se em conta, às vezes, o livro, o título, o capítulo, a seção e o parágrafo. Assim, uma norma tributária deve ser interpretada de acordo com os princípios que regem o sistema tributário. Em determinado momento histórico, por exemplo, predominava o princípio da autonomia da vontade. Com o surgimento do intervencionismo na economia contratual, a interpretação sistemática conduziu à proteção do contratante mais fraco. Nesse sentido, diz-se que as palavras da lei devem relacionar-se com o contexto em que se situam, pelo que muitos juristas preferem denominá-la interpretação lógico-sistemática65. A interpretação histórica baseia-se na investigação dos antecedentes da norma, do processo legislativo, a fim de descobrir o seu exato significado. É o melhor método para apurar a vontade do legislador e os objetivos que visava atingir (ratio legis). Consiste na pesquisa das circunstâncias que nortearam a sua elaboração, de ordem econômica, política e social (occasio legis), bem como do pensamento dominante ao tempo de sua formação. Abrange a análise dos fatos que a precederam e lhe deram origem, do projeto de lei, da justificativa ou exposição de motivos, dos trabalhos preparatórios, das atas das comissões, dos resumos das discussões, especialmente das referentes à rejeição e aprovação de emendas, dos Anais do Congresso, da aprovação final etc. A interpretação sociológica ou teleológica tem por objetivo adaptar o sentido ou finalidade da norma às novas exigências sociais, com abandono do individualismo que preponderou no período anterior à edição da Lei de Introdução às Normas do Direito Brasileiro. Tal recomendação é endereçada ao magistrado no art. 5º da referida lei, que assim dispõe: “Na aplicação da lei, o juiz atenderá aos fins sociais a que ela se destina e às exigências do bem comum”66. Quanto aos resultados, a interpretação pode ser declarativa, extensiva e restritiva. É declarativa quando proclama que o texto legal corresponde ao pensamento do legislador. Algumas vezes este não se expressa de modo preciso e diz menos ou mais do que pretendia dizer (minus dixit quam voluit — plus dixit quam voluit). Na interpretação declarativa constata-se que tal resultado não ocorreu. Na extensiva ou ampliativa, o intérprete conclui que o alcance ou espírito da lei é mais amplo do que indica o seu texto, abrangendo implicitamente outras situações. Na restritiva ocorre o inverso, impondo-se a limitação do campo de aplicação da lei67. Os diversos métodos de interpretação não operam isoladamente, não se repelem reciprocamente, mas se completam. As várias espécies ou técnicas de interpretação devem atuar conjuntamente, pois todas trazem sua contribuição para a descoberta do sentido e alcance da norma de direito68. O processo é gradativo, segundo expõe Francisco Amaral: “O intérprete procura, inicialmente, compreender o significado das palavras que formam o enunciado da proposição, dando-lhe sentido jurídico, não vulgar. Se necessário, passa à pesquisa do espírito da lei, identificando a relação de autonomia ou subordinação com as diversas normas do mesmo ordenamento. Aplica as regras da lógica jurídica, recusando a interpretação que leve a resultado contrário a outras normas ou ao próprio sistema, ou que conduza à consequência absurda, levando em conta o contexto histórico de sua elaboração e os fins sociais a que se destina”69."
}
    